[Killed] BlockStatement
lib/artist-roles.ts:45:50
   open_mic: 'open mic',
 }
 
-function tokenizeRoles(input: string | string[]) {
-  return (Array.isArray(input) ? input : [input])
-    .flatMap((part) => part.split(/[\/,;|]+/))
-    .map((part) => part.trim())
-    .filter(Boolean)
-}
+function tokenizeRoles(input: string | string[]) {}
 
 export function normalizeArtistRole(value: string | null | undefined): CanonicalArtistRole | null {
killedBy: artist readiness accepts an approved artist with a recognized role
statusReason: tokens is not iterable

[Survived] MethodExpression
lib/artist-roles.ts:46:10
 }
 
 function tokenizeRoles(input: string | string[]) {
-  return (Array.isArray(input) ? input : [input])
-    .flatMap((part) => part.split(/[\/,;|]+/))
-    .map((part) => part.trim())
-    .filter(Boolean)
+  return (Array.isArray(input) ? input : [input]).flatMap(part => part.split(/[\/,;|]+/)).map(part => part.trim())
 }
 

[Killed] ArrowFunction
lib/artist-roles.ts:47:14
 
 function tokenizeRoles(input: string | string[]) {
   return (Array.isArray(input) ? input : [input])
-    .flatMap((part) => part.split(/[\/,;|]+/))
+    .flatMap(() => undefined)
     .map((part) => part.trim())
     .filter(Boolean)
killedBy: artist roles deduplicates aliases while preserving role order
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] Regex
lib/artist-roles.ts:47:35
 
 function tokenizeRoles(input: string | string[]) {
   return (Array.isArray(input) ? input : [input])
-    .flatMap((part) => part.split(/[\/,;|]+/))
+    .flatMap((part) => part.split(/[^\/,;|]+/))
     .map((part) => part.trim())
     .filter(Boolean)
killedBy: artist readiness accepts an approved artist with a recognized role
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
lib/artist-roles.ts:48:10
 function tokenizeRoles(input: string | string[]) {
   return (Array.isArray(input) ? input : [input])
     .flatMap((part) => part.split(/[\/,;|]+/))
-    .map((part) => part.trim())
+    .map(() => undefined)
     .filter(Boolean)
 }
killedBy: artist readiness accepts an approved artist with a recognized role
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
lib/artist-roles.ts:48:20
 function tokenizeRoles(input: string | string[]) {
   return (Array.isArray(input) ? input : [input])
     .flatMap((part) => part.split(/[\/,;|]+/))
-    .map((part) => part.trim())
+    .map((part) => part)
     .filter(Boolean)
 }

[Killed] BlockStatement
lib/artist-roles.ts:52:99
     .filter(Boolean)
 }
 
-export function normalizeArtistRole(value: string | null | undefined): CanonicalArtistRole | null {
-  const text = String(value ?? '').trim().toLowerCase()
-  if (!text) return null
-
-  const normalized = text
-    .replace(/[._]+/g, ' ')
-    .replace(/\s+/g, ' ')
-    .trim()
-
-  return ROLE_ALIASES[normalized] ?? null
-}
+export function normalizeArtistRole(value: string | null | undefined): CanonicalArtistRole | null {}
 
 export function canonicalRoleValue(value: string | null | undefined) {
killedBy: artist readiness accepts an approved artist with a recognized role
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
lib/artist-roles.ts:53:16
 }
 
 export function normalizeArtistRole(value: string | null | undefined): CanonicalArtistRole | null {
-  const text = String(value ?? '').trim().toLowerCase()
+  const text = String(value ?? '').trim().toUpperCase()
   if (!text) return null
 
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'support', 'host', 'head' ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] LogicalOperator
lib/artist-roles.ts:53:23
 }
 
 export function normalizeArtistRole(value: string | null | undefined): CanonicalArtistRole | null {
-  const text = String(value ?? '').trim().toLowerCase()
+  const text = String(value && '').trim().toLowerCase()
   if (!text) return null
 
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'support', 'host', 'head' ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] BooleanLiteral
lib/artist-roles.ts:54:7
 
 export function normalizeArtistRole(value: string | null | undefined): CanonicalArtistRole | null {
   const text = String(value ?? '').trim().toLowerCase()
-  if (!text) return null
+  if (text) return null
 
   const normalized = text
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'support', 'host', 'head' ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] ConditionalExpression
lib/artist-roles.ts:54:7
 
 export function normalizeArtistRole(value: string | null | undefined): CanonicalArtistRole | null {
   const text = String(value ?? '').trim().toLowerCase()
-  if (!text) return null
+  if (true) return null
 
   const normalized = text
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'support', 'host', 'head' ] to deeply equal [ 'head', 'host', 'support' ]

[Survived] MethodExpression
lib/artist-roles.ts:56:22
   const text = String(value ?? '').trim().toLowerCase()
   if (!text) return null
 
-  const normalized = text
-    .replace(/[._]+/g, ' ')
-    .replace(/\s+/g, ' ')
-    .trim()
+  const normalized = text.replace(/[._]+/g, ' ').replace(/\s+/g, ' ')
 
   return ROLE_ALIASES[normalized] ?? null

[Survived] Regex
lib/artist-roles.ts:57:14
   if (!text) return null
 
   const normalized = text
-    .replace(/[._]+/g, ' ')
+    .replace(/[._]/g, ' ')
     .replace(/\s+/g, ' ')
     .trim()

[Survived] Regex
lib/artist-roles.ts:58:14
 
   const normalized = text
     .replace(/[._]+/g, ' ')
-    .replace(/\s+/g, ' ')
+    .replace(/\s/g, ' ')
     .trim()
 

[Killed] LogicalOperator
lib/artist-roles.ts:61:10
     .replace(/\s+/g, ' ')
     .trim()
 
-  return ROLE_ALIASES[normalized] ?? null
+  return ROLE_ALIASES[normalized] && null
 }
 
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'support', 'host', 'head' ] to deeply equal [ 'head', 'host', 'support' ]

[NoCoverage] BlockStatement
lib/artist-roles.ts:64:70
   return ROLE_ALIASES[normalized] ?? null
 }
 
-export function canonicalRoleValue(value: string | null | undefined) {
-  return normalizeArtistRole(value)
-}
+export function canonicalRoleValue(value: string | null | undefined) {}
 
 export function canonicalRoleValues(values: string | string[] | null | undefined) {

[NoCoverage] BlockStatement
lib/artist-roles.ts:68:83
   return normalizeArtistRole(value)
 }
 
-export function canonicalRoleValues(values: string | string[] | null | undefined) {
-  return normalizeArtistRoleList(values)
-}
+export function canonicalRoleValues(values: string | string[] | null | undefined) {}
 
 export function formatArtistRole(value: string | null | undefined) {

[NoCoverage] BlockStatement
lib/artist-roles.ts:72:68
   return normalizeArtistRoleList(values)
 }
 
-export function formatArtistRole(value: string | null | undefined) {
-  const normalized = normalizeArtistRole(value)
-  if (!normalized) {
-    const fallback = String(value ?? '').trim()
-    return fallback || null
-  }
-
-  return ARTIST_ROLE_LABELS[normalized]
-}
+export function formatArtistRole(value: string | null | undefined) {}
 
 export function normalizeArtistRoleList(values: string | string[] | null | undefined) {

[NoCoverage] BooleanLiteral
lib/artist-roles.ts:74:7
 
 export function formatArtistRole(value: string | null | undefined) {
   const normalized = normalizeArtistRole(value)
-  if (!normalized) {
+  if (normalized) {
     const fallback = String(value ?? '').trim()
     return fallback || null

[NoCoverage] ConditionalExpression
lib/artist-roles.ts:74:7
 
 export function formatArtistRole(value: string | null | undefined) {
   const normalized = normalizeArtistRole(value)
-  if (!normalized) {
+  if (true) {
     const fallback = String(value ?? '').trim()
     return fallback || null

[NoCoverage] LogicalOperator
lib/artist-roles.ts:75:29
 export function formatArtistRole(value: string | null | undefined) {
   const normalized = normalizeArtistRole(value)
   if (!normalized) {
-    const fallback = String(value ?? '').trim()
+    const fallback = String(value && '').trim()
     return fallback || null
   }

[NoCoverage] MethodExpression
lib/artist-roles.ts:75:22
 export function formatArtistRole(value: string | null | undefined) {
   const normalized = normalizeArtistRole(value)
   if (!normalized) {
-    const fallback = String(value ?? '').trim()
+    const fallback = String(value ?? '')
     return fallback || null
   }

[NoCoverage] ConditionalExpression
lib/artist-roles.ts:76:12
   const normalized = normalizeArtistRole(value)
   if (!normalized) {
     const fallback = String(value ?? '').trim()
-    return fallback || null
+    return false
   }
 

[NoCoverage] LogicalOperator
lib/artist-roles.ts:76:12
   const normalized = normalizeArtistRole(value)
   if (!normalized) {
     const fallback = String(value ?? '').trim()
-    return fallback || null
+    return fallback && null
   }
 

[Killed] BlockStatement
lib/artist-roles.ts:82:87
   return ARTIST_ROLE_LABELS[normalized]
 }
 
-export function normalizeArtistRoleList(values: string | string[] | null | undefined) {
-  const tokens = values == null ? [] : tokenizeRoles(values)
-  const next: CanonicalArtistRole[] = []
-
-  for (const token of tokens) {
-    const normalized = normalizeArtistRole(token)
-    if (normalized && !next.includes(normalized)) {
-      next.push(normalized)
-    }
-  }
-
-  return next
-}
+export function normalizeArtistRoleList(values: string | string[] | null | undefined) {}
 
 export function formatArtistRoleList(values: string | string[] | null | undefined) {
killedBy: artist roles deduplicates aliases while preserving role order
statusReason: expected undefined to deeply equal [ 'konferansier', 'headliner' ]

[Killed] ConditionalExpression
lib/artist-roles.ts:83:18
 }
 
 export function normalizeArtistRoleList(values: string | string[] | null | undefined) {
-  const tokens = values == null ? [] : tokenizeRoles(values)
+  const tokens = true ? [] : tokenizeRoles(values)
   const next: CanonicalArtistRole[] = []
 
killedBy: artist roles deduplicates aliases while preserving role order
statusReason: expected [] to deeply equal [ 'konferansier', 'headliner' ]

[Killed] EqualityOperator
lib/artist-roles.ts:83:18
 }
 
 export function normalizeArtistRoleList(values: string | string[] | null | undefined) {
-  const tokens = values == null ? [] : tokenizeRoles(values)
+  const tokens = values != null ? [] : tokenizeRoles(values)
   const next: CanonicalArtistRole[] = []
 
killedBy: artist roles deduplicates aliases while preserving role order
statusReason: expected [] to deeply equal [ 'konferansier', 'headliner' ]

[Killed] BlockStatement
lib/artist-roles.ts:86:31
   const tokens = values == null ? [] : tokenizeRoles(values)
   const next: CanonicalArtistRole[] = []
 
-  for (const token of tokens) {
-    const normalized = normalizeArtistRole(token)
-    if (normalized && !next.includes(normalized)) {
-      next.push(normalized)
-    }
-  }
+  for (const token of tokens) {}
 
   return next
killedBy: artist roles deduplicates aliases while preserving role order
statusReason: expected [] to deeply equal [ 'konferansier', 'headliner' ]

[Killed] LogicalOperator
lib/artist-roles.ts:88:9
 
   for (const token of tokens) {
     const normalized = normalizeArtistRole(token)
-    if (normalized && !next.includes(normalized)) {
+    if (normalized || !next.includes(normalized)) {
       next.push(normalized)
     }
killedBy: artist roles deduplicates aliases while preserving role order
statusReason: expected [ Array(3) ] to deeply equal [ 'konferansier', 'headliner' ]

[Killed] ConditionalExpression
lib/artist-roles.ts:88:9
 
   for (const token of tokens) {
     const normalized = normalizeArtistRole(token)
-    if (normalized && !next.includes(normalized)) {
+    if (true) {
       next.push(normalized)
     }
killedBy: artist roles deduplicates aliases while preserving role order
statusReason: expected [ Array(3) ] to deeply equal [ 'konferansier', 'headliner' ]

[Killed] CallExpression
lib/artist-roles.ts:89:7
   for (const token of tokens) {
     const normalized = normalizeArtistRole(token)
     if (normalized && !next.includes(normalized)) {
-      next.push(normalized)
+      ;
     }
   }
killedBy: artist roles deduplicates aliases while preserving role order
statusReason: expected [] to deeply equal [ 'konferansier', 'headliner' ]

[Killed] BlockStatement
lib/artist-roles.ts:96:84
   return next
 }
 
-export function formatArtistRoleList(values: string | string[] | null | undefined) {
-  return normalizeArtistRoleList(values).map((value) => ARTIST_ROLE_LABELS[value])
-}
+export function formatArtistRoleList(values: string | string[] | null | undefined) {}
 
 export function formatArtistRoleSummary(values: string | string[] | null | undefined, fallback = 'Komiker') {
killedBy: artist roles uses a fallback when no known role exists
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] ArrowFunction
lib/artist-roles.ts:97:46
 }
 
 export function formatArtistRoleList(values: string | string[] | null | undefined) {
-  return normalizeArtistRoleList(values).map((value) => ARTIST_ROLE_LABELS[value])
+  return normalizeArtistRoleList(values).map(() => undefined)
 }
 

[Killed] BlockStatement
lib/artist-roles.ts:100:109
   return normalizeArtistRoleList(values).map((value) => ARTIST_ROLE_LABELS[value])
 }
 
-export function formatArtistRoleSummary(values: string | string[] | null | undefined, fallback = 'Komiker') {
-  const labels = formatArtistRoleList(values)
-  return labels.length > 0 ? labels.join(', ') : fallback
-}
+export function formatArtistRoleSummary(values: string | string[] | null | undefined, fallback = 'Komiker') {}
 
 export function canonicalRoleLabel(value: string | null | undefined) {
killedBy: artist roles uses a fallback when no known role exists
statusReason: expected undefined to be 'Comedian' // Object.is equality

[NoCoverage] StringLiteral
lib/artist-roles.ts:100:98
   return normalizeArtistRoleList(values).map((value) => ARTIST_ROLE_LABELS[value])
 }
 
-export function formatArtistRoleSummary(values: string | string[] | null | undefined, fallback = 'Komiker') {
+export function formatArtistRoleSummary(values: string | string[] | null | undefined, fallback = "") {
   const labels = formatArtistRoleList(values)
   return labels.length > 0 ? labels.join(', ') : fallback

[Killed] ConditionalExpression
lib/artist-roles.ts:102:10
 
 export function formatArtistRoleSummary(values: string | string[] | null | undefined, fallback = 'Komiker') {
   const labels = formatArtistRoleList(values)
-  return labels.length > 0 ? labels.join(', ') : fallback
+  return true ? labels.join(', ') : fallback
 }
 
killedBy: artist roles uses a fallback when no known role exists
statusReason: expected '' to be 'Comedian' // Object.is equality

[Killed] EqualityOperator
lib/artist-roles.ts:102:10
 
 export function formatArtistRoleSummary(values: string | string[] | null | undefined, fallback = 'Komiker') {
   const labels = formatArtistRoleList(values)
-  return labels.length > 0 ? labels.join(', ') : fallback
+  return labels.length >= 0 ? labels.join(', ') : fallback
 }
 
killedBy: artist roles uses a fallback when no known role exists
statusReason: expected '' to be 'Comedian' // Object.is equality

[NoCoverage] BlockStatement
lib/artist-roles.ts:105:70
   return labels.length > 0 ? labels.join(', ') : fallback
 }
 
-export function canonicalRoleLabel(value: string | null | undefined) {
-  const formatted = formatArtistRole(value)
-  return formatted ?? (String(value ?? '').trim() || null)
-}
+export function canonicalRoleLabel(value: string | null | undefined) {}
 
 export function artistMatchesRole(

[NoCoverage] LogicalOperator
lib/artist-roles.ts:107:31
 
 export function canonicalRoleLabel(value: string | null | undefined) {
   const formatted = formatArtistRole(value)
-  return formatted ?? (String(value ?? '').trim() || null)
+  return formatted ?? (String(value && '').trim() || null)
 }
 

[NoCoverage] LogicalOperator
lib/artist-roles.ts:107:10
 
 export function canonicalRoleLabel(value: string | null | undefined) {
   const formatted = formatArtistRole(value)
-  return formatted ?? (String(value ?? '').trim() || null)
+  return formatted && (String(value ?? '').trim() || null)
 }
 

[Killed] BlockStatement
lib/artist-roles.ts:113:3
 export function artistMatchesRole(
   roleName: string | null | undefined,
   artist: { category?: string | string[] | null }
-) {
-  const normalizedRole = normalizeArtistRole(roleName)
-  if (!normalizedRole) return false
-
-  const artistRoles = normalizeArtistRoleList(artist.category)
-
-  return artistRoles.includes(normalizedRole)
-}
+) {}
 
 export const ARTIST_ROLE_LABEL_OPTIONS = ARTIST_ROLE_OPTIONS.map((option) => option.label)
killedBy: artist roles matches an artist against any canonical category
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
lib/artist-roles.ts:115:7
   artist: { category?: string | string[] | null }
 ) {
   const normalizedRole = normalizeArtistRole(roleName)
-  if (!normalizedRole) return false
+  if (true) return false
 
   const artistRoles = normalizeArtistRoleList(artist.category)
killedBy: artist roles matches an artist against any canonical category
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
lib/artist-roles.ts:115:7
   artist: { category?: string | string[] | null }
 ) {
   const normalizedRole = normalizeArtistRole(roleName)
-  if (!normalizedRole) return false
+  if (normalizedRole) return false
 
   const artistRoles = normalizeArtistRoleList(artist.category)
killedBy: artist roles matches an artist against any canonical category
statusReason: expected false to be true // Object.is equality
