[Killed] BlockStatement
lib/checkout/errors.ts:51:88
   /** Technical context for the log — never shown to the user. */
   readonly detail?: string
 
-  constructor(code: CheckoutErrorCode, options?: { detail?: string; cause?: unknown }) {
-    super(MESSAGES[code], options?.cause !== undefined ? { cause: options.cause } : undefined)
-    this.name = 'CheckoutError'
-    this.code = code
-    this.detail = options?.detail
-  }
+  constructor(code: CheckoutErrorCode, options?: { detail?: string; cause?: unknown }) {}
 
   get isOperatorFault() {
killedBy: checkout errors classifies price_missing operator fault as true
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] ConditionalExpression
lib/checkout/errors.ts:52:27
   readonly detail?: string
 
   constructor(code: CheckoutErrorCode, options?: { detail?: string; cause?: unknown }) {
-    super(MESSAGES[code], options?.cause !== undefined ? { cause: options.cause } : undefined)
+    super(MESSAGES[code], true ? { cause: options.cause } : undefined)
     this.name = 'CheckoutError'
     this.code = code
killedBy: checkout errors classifies price_missing operator fault as true
statusReason: Cannot read properties of undefined (reading 'cause')

[Killed] OptionalChaining
lib/checkout/errors.ts:52:27
   readonly detail?: string
 
   constructor(code: CheckoutErrorCode, options?: { detail?: string; cause?: unknown }) {
-    super(MESSAGES[code], options?.cause !== undefined ? { cause: options.cause } : undefined)
+    super(MESSAGES[code], options.cause !== undefined ? { cause: options.cause } : undefined)
     this.name = 'CheckoutError'
     this.code = code
killedBy: checkout errors classifies price_missing operator fault as true
statusReason: Cannot read properties of undefined (reading 'cause')

[Killed] OptionalChaining
lib/checkout/errors.ts:55:19
     super(MESSAGES[code], options?.cause !== undefined ? { cause: options.cause } : undefined)
     this.name = 'CheckoutError'
     this.code = code
-    this.detail = options?.detail
+    this.detail = options.detail
   }
 
killedBy: checkout errors classifies price_missing operator fault as true
statusReason: Cannot read properties of undefined (reading 'detail')

[Killed] BlockStatement
lib/checkout/errors.ts:58:25
     this.detail = options?.detail
   }
 
-  get isOperatorFault() {
-    return OPERATOR_FAULT.has(this.code)
-  }
+  get isOperatorFault() {}
 }
 
killedBy: checkout errors classifies price_missing operator fault as true
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
lib/checkout/errors.ts:63:63
   }
 }
 
-export function checkoutErrorMessage(code: CheckoutErrorCode) {
-  return MESSAGES[code]
-}
+export function checkoutErrorMessage(code: CheckoutErrorCode) {}
 
 type StripeErrorShape = {
killedBy: checkout errors has safe user copy for show_not_found
statusReason: expected undefined to be truthy

[Killed] BlockStatement
lib/checkout/errors.ts:77:65
 }
 
 /** Stripe errors are plain objects with a `type` field — no reason to load the SDK to recognise them. */
-function asStripeError(error: unknown): StripeErrorShape | null {
-  if (typeof error !== 'object' || error === null) return null
-  const type = (error as { type?: unknown }).type
-  if (typeof type !== 'string' || !type.startsWith('Stripe')) return null
-  return error as StripeErrorShape
-}
+function asStripeError(error: unknown): StripeErrorShape | null {}
 
 /** True when Stripe does not recognise `resourceId` — typically a cached ID from another account. */
killedBy: checkout errors maps StripeAuthenticationError to configuration failure
statusReason: expected 'unknown' to be 'stripe_config' // Object.is equality

[Killed] EqualityOperator
lib/checkout/errors.ts:78:7
 
 /** Stripe errors are plain objects with a `type` field — no reason to load the SDK to recognise them. */
 function asStripeError(error: unknown): StripeErrorShape | null {
-  if (typeof error !== 'object' || error === null) return null
+  if (typeof error === 'object' || error === null) return null
   const type = (error as { type?: unknown }).type
   if (typeof type !== 'string' || !type.startsWith('Stripe')) return null
killedBy: checkout errors maps StripeAuthenticationError to configuration failure
statusReason: expected 'unknown' to be 'stripe_config' // Object.is equality

[Killed] EqualityOperator
lib/checkout/errors.ts:78:36
 
 /** Stripe errors are plain objects with a `type` field — no reason to load the SDK to recognise them. */
 function asStripeError(error: unknown): StripeErrorShape | null {
-  if (typeof error !== 'object' || error === null) return null
+  if (typeof error !== 'object' || error !== null) return null
   const type = (error as { type?: unknown }).type
   if (typeof type !== 'string' || !type.startsWith('Stripe')) return null
killedBy: checkout errors maps StripeAuthenticationError to configuration failure
statusReason: expected 'unknown' to be 'stripe_config' // Object.is equality

[Killed] LogicalOperator
lib/checkout/errors.ts:80:7
 function asStripeError(error: unknown): StripeErrorShape | null {
   if (typeof error !== 'object' || error === null) return null
   const type = (error as { type?: unknown }).type
-  if (typeof type !== 'string' || !type.startsWith('Stripe')) return null
+  if (typeof type !== 'string' && !type.startsWith('Stripe')) return null
   return error as StripeErrorShape
 }
killedBy: checkout errors maps ordinary errors to an unknown checkout error with a log detail
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] EqualityOperator
lib/checkout/errors.ts:80:7
 function asStripeError(error: unknown): StripeErrorShape | null {
   if (typeof error !== 'object' || error === null) return null
   const type = (error as { type?: unknown }).type
-  if (typeof type !== 'string' || !type.startsWith('Stripe')) return null
+  if (typeof type === 'string' || !type.startsWith('Stripe')) return null
   return error as StripeErrorShape
 }
killedBy: checkout errors maps StripeAuthenticationError to configuration failure
statusReason: expected 'unknown' to be 'stripe_config' // Object.is equality

[Killed] BlockStatement
lib/checkout/errors.ts:85:77
 }
 
 /** True when Stripe does not recognise `resourceId` — typically a cached ID from another account. */
-export function isMissingStripeResource(error: unknown, resourceId: string) {
-  const stripeError = asStripeError(error)
-  if (!stripeError || stripeError.code !== 'resource_missing') return false
-  return (stripeError.message ?? '').includes(resourceId)
-}
+export function isMissingStripeResource(error: unknown, resourceId: string) {}
 
 /**
killedBy: checkout errors recognizes a missing Stripe resource only for the named ID
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
lib/checkout/errors.ts:87:23
 /** True when Stripe does not recognise `resourceId` — typically a cached ID from another account. */
 export function isMissingStripeResource(error: unknown, resourceId: string) {
   const stripeError = asStripeError(error)
-  if (!stripeError || stripeError.code !== 'resource_missing') return false
+  if (!stripeError || stripeError.code === 'resource_missing') return false
   return (stripeError.message ?? '').includes(resourceId)
 }
killedBy: checkout errors recognizes a missing Stripe resource only for the named ID
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
lib/checkout/errors.ts:87:7
 /** True when Stripe does not recognise `resourceId` — typically a cached ID from another account. */
 export function isMissingStripeResource(error: unknown, resourceId: string) {
   const stripeError = asStripeError(error)
-  if (!stripeError || stripeError.code !== 'resource_missing') return false
+  if (stripeError || stripeError.code !== 'resource_missing') return false
   return (stripeError.message ?? '').includes(resourceId)
 }
killedBy: checkout errors recognizes a missing Stripe resource only for the named ID
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
lib/checkout/errors.ts:88:11
 export function isMissingStripeResource(error: unknown, resourceId: string) {
   const stripeError = asStripeError(error)
   if (!stripeError || stripeError.code !== 'resource_missing') return false
-  return (stripeError.message ?? '').includes(resourceId)
+  return (stripeError.message && '').includes(resourceId)
 }
 
killedBy: checkout errors recognizes a missing Stripe resource only for the named ID
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/checkout/errors.ts:97:7
  * get a very different message in the two cases.
  */
 export function toCheckoutError(error: unknown): CheckoutError {
-  if (error instanceof CheckoutError) return error
+  if (false) return error
 
   const stripeError = asStripeError(error)
killedBy: checkout errors preserves an existing checkout error
statusReason: expected CheckoutError: Checkout could not be open… { …(2) } to be CheckoutError: This show is sold out. { …(2) } // Object.is equality

[Killed] ConditionalExpression
lib/checkout/errors.ts:97:7
  * get a very different message in the two cases.
  */
 export function toCheckoutError(error: unknown): CheckoutError {
-  if (error instanceof CheckoutError) return error
+  if (true) return error
 
   const stripeError = asStripeError(error)
killedBy: checkout errors maps StripeAuthenticationError to configuration failure
statusReason: expected undefined to be 'stripe_config' // Object.is equality

[Killed] ConditionalExpression
lib/checkout/errors.ts:100:7
   if (error instanceof CheckoutError) return error
 
   const stripeError = asStripeError(error)
-  if (stripeError) {
+  if (true) {
     const detail = [
       stripeError.type,
killedBy: checkout errors maps ordinary errors to an unknown checkout error with a log detail
statusReason: Cannot read properties of null (reading 'type')

[Killed] ConditionalExpression
lib/checkout/errors.ts:100:7
   if (error instanceof CheckoutError) return error
 
   const stripeError = asStripeError(error)
-  if (stripeError) {
+  if (false) {
     const detail = [
       stripeError.type,
killedBy: checkout errors maps StripeAuthenticationError to configuration failure
statusReason: expected 'unknown' to be 'stripe_config' // Object.is equality

[Survived] MethodExpression
lib/checkout/errors.ts:101:20
 
   const stripeError = asStripeError(error)
   if (stripeError) {
-    const detail = [
-      stripeError.type,
-      stripeError.code,
-      stripeError.param && `param=${stripeError.param}`,
-      stripeError.requestId && `req=${stripeError.requestId}`,
-      stripeError.message,
-    ]
-      .filter(Boolean)
+    const detail = [stripeError.type, stripeError.code, stripeError.param && `param=${stripeError.param}`, stripeError.requestId && `req=${stripeError.requestId}`, stripeError.message]
       .join(' | ')
 

[Killed] ArrayDeclaration
lib/checkout/errors.ts:101:20
 
   const stripeError = asStripeError(error)
   if (stripeError) {
-    const detail = [
-      stripeError.type,
-      stripeError.code,
-      stripeError.param && `param=${stripeError.param}`,
-      stripeError.requestId && `req=${stripeError.requestId}`,
-      stripeError.message,
-    ]
+    const detail = []
       .filter(Boolean)
       .join(' | ')
killedBy: checkout errors maps unknown Stripe error types without exposing their message
statusReason: expected '' to contain 'internal detail'

[Survived] LogicalOperator
lib/checkout/errors.ts:104:7
     const detail = [
       stripeError.type,
       stripeError.code,
-      stripeError.param && `param=${stripeError.param}`,
+      stripeError.param || `param=${stripeError.param}`,
       stripeError.requestId && `req=${stripeError.requestId}`,
       stripeError.message,

[Survived] ConditionalExpression
lib/checkout/errors.ts:104:7
     const detail = [
       stripeError.type,
       stripeError.code,
-      stripeError.param && `param=${stripeError.param}`,
+      true,
       stripeError.requestId && `req=${stripeError.requestId}`,
       stripeError.message,

[Survived] ConditionalExpression
lib/checkout/errors.ts:105:7
       stripeError.type,
       stripeError.code,
       stripeError.param && `param=${stripeError.param}`,
-      stripeError.requestId && `req=${stripeError.requestId}`,
+      false,
       stripeError.message,
     ]

[Survived] ConditionalExpression
lib/checkout/errors.ts:105:7
       stripeError.type,
       stripeError.code,
       stripeError.param && `param=${stripeError.param}`,
-      stripeError.requestId && `req=${stripeError.requestId}`,
+      true,
       stripeError.message,
     ]

[Killed] ConditionalExpression
lib/checkout/errors.ts:116:7
       // account, or a resource that does not exist. Always our fault.
       case 'StripeAuthenticationError':
       case 'StripePermissionError':
-      case 'StripeInvalidRequestError':
-        return new CheckoutError('stripe_config', { detail, cause: error })
+      case 'StripeInvalidRequestError':
       case 'StripeConnectionError':
       case 'StripeRateLimitError':
killedBy: checkout errors maps StripeAuthenticationError to configuration failure
statusReason: expected 'stripe_unavailable' to be 'stripe_config' // Object.is equality

[Killed] StringLiteral
lib/checkout/errors.ts:119:12
       case 'StripeInvalidRequestError':
         return new CheckoutError('stripe_config', { detail, cause: error })
       case 'StripeConnectionError':
-      case 'StripeRateLimitError':
+      case "":
       case 'StripeAPIError':
         return new CheckoutError('stripe_unavailable', { detail, cause: error })
killedBy: checkout errors maps StripeRateLimitError to temporary unavailability
statusReason: expected 'unknown' to be 'stripe_unavailable' // Object.is equality

[Killed] ConditionalExpression
lib/checkout/errors.ts:120:7
         return new CheckoutError('stripe_config', { detail, cause: error })
       case 'StripeConnectionError':
       case 'StripeRateLimitError':
-      case 'StripeAPIError':
-        return new CheckoutError('stripe_unavailable', { detail, cause: error })
+      case 'StripeAPIError':
       default:
         return new CheckoutError('unknown', { detail, cause: error })
killedBy: checkout errors maps StripeConnectionError to temporary unavailability
statusReason: expected 'unknown' to be 'stripe_unavailable' // Object.is equality

[Killed] StringLiteral
lib/checkout/errors.ts:120:12
         return new CheckoutError('stripe_config', { detail, cause: error })
       case 'StripeConnectionError':
       case 'StripeRateLimitError':
-      case 'StripeAPIError':
+      case "":
         return new CheckoutError('stripe_unavailable', { detail, cause: error })
       default:
killedBy: checkout errors maps StripeAPIError to temporary unavailability
statusReason: expected 'unknown' to be 'stripe_unavailable' // Object.is equality

[Killed] ConditionalExpression
lib/checkout/errors.ts:122:7
       case 'StripeRateLimitError':
       case 'StripeAPIError':
         return new CheckoutError('stripe_unavailable', { detail, cause: error })
-      default:
-        return new CheckoutError('unknown', { detail, cause: error })
+      default:
     }
   }
killedBy: checkout errors maps unknown Stripe error types without exposing their message
statusReason: expected '[object Object]' to contain 'internal detail'

[Killed] StringLiteral
lib/checkout/errors.ts:123:34
       case 'StripeAPIError':
         return new CheckoutError('stripe_unavailable', { detail, cause: error })
       default:
-        return new CheckoutError('unknown', { detail, cause: error })
+        return new CheckoutError("", { detail, cause: error })
     }
   }
killedBy: checkout errors maps unknown Stripe error types without exposing their message
statusReason: expected '' to be 'unknown' // Object.is equality

[Killed] StringLiteral
lib/checkout/errors.ts:127:43
     }
   }
 
-  const detail = error instanceof Error ? `${error.name}: ${error.message}` : String(error)
+  const detail = error instanceof Error ? `` : String(error)
   return new CheckoutError('unknown', { detail, cause: error })
 }
killedBy: checkout errors maps ordinary errors to an unknown checkout error with a log detail
statusReason: expected CheckoutError: Checkout could not be open… { …(2) } to match object { code: 'unknown', …(1) }
(1 matching property omitted from actual)

[Killed] ObjectLiteral
lib/checkout/errors.ts:128:39
   }
 
   const detail = error instanceof Error ? `${error.name}: ${error.message}` : String(error)
-  return new CheckoutError('unknown', { detail, cause: error })
+  return new CheckoutError('unknown', {})
 }
 
killedBy: checkout errors maps ordinary errors to an unknown checkout error with a log detail
statusReason: expected CheckoutError: Checkout could not be open… { …(2) } to match object { code: 'unknown', …(1) }
(1 matching property omitted from actual)

[Killed] StringLiteral
lib/checkout/errors.ts:128:28
   }
 
   const detail = error instanceof Error ? `${error.name}: ${error.message}` : String(error)
-  return new CheckoutError('unknown', { detail, cause: error })
+  return new CheckoutError("", { detail, cause: error })
 }
 
killedBy: checkout errors maps ordinary errors to an unknown checkout error with a log detail
statusReason: expected CheckoutError { code: '', …(1) } to match object { code: 'unknown', …(1) }
(1 matching property omitted from actual)

[Killed] BlockStatement
lib/checkout/errors.ts:132:111
 }
 
 /** One loggable line with everything needed to find the error again in Stripe. */
-export function describeCheckoutError(error: CheckoutError, context: Record<string, string | undefined> = {}) {
-  const parts = Object.entries(context)
-    .filter(([, value]) => value)
-    .map(([key, value]) => `${key}=${value}`)
-
-  return [`[${error.code}]`, ...parts, error.detail ?? error.message].join(' ')
-}
+export function describeCheckoutError(error: CheckoutError, context: Record<string, string | undefined> = {}) {}
 
killedBy: checkout errors builds a concise contextual log line and drops empty context
statusReason: expected undefined to be '[stripe_config] showId=show-1 req=req…' // Object.is equality

[Killed] MethodExpression
lib/checkout/errors.ts:133:17
 
 /** One loggable line with everything needed to find the error again in Stripe. */
 export function describeCheckoutError(error: CheckoutError, context: Record<string, string | undefined> = {}) {
-  const parts = Object.entries(context)
-    .filter(([, value]) => value)
+  const parts = Object.entries(context)
     .map(([key, value]) => `${key}=${value}`)
 
killedBy: checkout errors builds a concise contextual log line and drops empty context
statusReason: expected '[stripe_config] showId=show-1 slug=un…' to be '[stripe_config] showId=show-1 req=req…' // Object.is equality

[Killed] ArrowFunction
lib/checkout/errors.ts:134:13
 /** One loggable line with everything needed to find the error again in Stripe. */
 export function describeCheckoutError(error: CheckoutError, context: Record<string, string | undefined> = {}) {
   const parts = Object.entries(context)
-    .filter(([, value]) => value)
+    .filter(() => undefined)
     .map(([key, value]) => `${key}=${value}`)
 
killedBy: checkout errors builds a concise contextual log line and drops empty context
statusReason: expected '[stripe_config] req=req_123' to be '[stripe_config] showId=show-1 req=req…' // Object.is equality

[Killed] ArrowFunction
lib/checkout/errors.ts:135:10
 export function describeCheckoutError(error: CheckoutError, context: Record<string, string | undefined> = {}) {
   const parts = Object.entries(context)
     .filter(([, value]) => value)
-    .map(([key, value]) => `${key}=${value}`)
+    .map(() => undefined)
 
   return [`[${error.code}]`, ...parts, error.detail ?? error.message].join(' ')
killedBy: checkout errors builds a concise contextual log line and drops empty context
statusReason: expected '[stripe_config]  req=req_123' to be '[stripe_config] showId=show-1 req=req…' // Object.is equality

[Killed] LogicalOperator
lib/checkout/errors.ts:137:40
     .filter(([, value]) => value)
     .map(([key, value]) => `${key}=${value}`)
 
-  return [`[${error.code}]`, ...parts, error.detail ?? error.message].join(' ')
+  return [`[${error.code}]`, ...parts, error.detail && error.message].join(' ')
 }
 
killedBy: checkout errors builds a concise contextual log line and drops empty context
statusReason: expected '[stripe_config] showId=show-1 Payment…' to be '[stripe_config] showId=show-1 req=req…' // Object.is equality

[Killed] StringLiteral
lib/checkout/errors.ts:137:11
     .filter(([, value]) => value)
     .map(([key, value]) => `${key}=${value}`)
 
-  return [`[${error.code}]`, ...parts, error.detail ?? error.message].join(' ')
+  return [``, ...parts, error.detail ?? error.message].join(' ')
 }
 
killedBy: checkout errors builds a concise contextual log line and drops empty context
statusReason: expected ' showId=show-1 req=req_123' to be '[stripe_config] showId=show-1 req=req…' // Object.is equality
