[Killed] BlockStatement
lib/event-filters.ts:37:62
  * The timezone stays Oslo regardless of interface language — the venues
  * are in Norway, so that is where a show date belongs.
  */
-export function getOsloToday(now: Date = new Date()): string {
-  // 'sv-SE' yields the ISO form YYYY-MM-DD directly.
-  return new Intl.DateTimeFormat('sv-SE', { timeZone: 'Europe/Oslo' }).format(now)
-}
+export function getOsloToday(now: Date = new Date()): string {}
 
 /** Parses `YYYY-MM-DD` into a local Date at midnight, with no UTC shift. */
killedBy: event date filters uses Oslo time across the UTC midnight boundary
statusReason: expected undefined to be '2026-01-02' // Object.is equality

[Killed] StringLiteral
lib/event-filters.ts:39:55
  */
 export function getOsloToday(now: Date = new Date()): string {
   // 'sv-SE' yields the ISO form YYYY-MM-DD directly.
-  return new Intl.DateTimeFormat('sv-SE', { timeZone: 'Europe/Oslo' }).format(now)
+  return new Intl.DateTimeFormat('sv-SE', { timeZone: "" }).format(now)
 }
 
killedBy: event date filters uses Oslo time across the UTC midnight boundary
statusReason: Invalid time zone specified:

[Killed] BlockStatement
lib/event-filters.ts:43:51
 }
 
 /** Parses `YYYY-MM-DD` into a local Date at midnight, with no UTC shift. */
-export function parseIsoDate(value: string): Date {
-  const [year, month, day] = value.slice(0, 10).split('-').map(Number)
-  return new Date(year, (month ?? 1) - 1, day ?? 1)
-}
+export function parseIsoDate(value: string): Date {}
 
 /** The other way round: local Date to `YYYY-MM-DD`. */
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: Cannot read properties of undefined (reading 'getDay')

[Survived] MethodExpression
lib/event-filters.ts:44:30
 
 /** Parses `YYYY-MM-DD` into a local Date at midnight, with no UTC shift. */
 export function parseIsoDate(value: string): Date {
-  const [year, month, day] = value.slice(0, 10).split('-').map(Number)
+  const [year, month, day] = value.split('-').map(Number)
   return new Date(year, (month ?? 1) - 1, day ?? 1)
 }

[Killed] LogicalOperator
lib/event-filters.ts:45:43
 /** Parses `YYYY-MM-DD` into a local Date at midnight, with no UTC shift. */
 export function parseIsoDate(value: string): Date {
   const [year, month, day] = value.slice(0, 10).split('-').map(Number)
-  return new Date(year, (month ?? 1) - 1, day ?? 1)
+  return new Date(year, (month ?? 1) - 1, day && 1)
 }
 
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: expected { Object (from, to) } to deeply equal { Object (from, to) }

[Killed] ArithmeticOperator
lib/event-filters.ts:45:25
 /** Parses `YYYY-MM-DD` into a local Date at midnight, with no UTC shift. */
 export function parseIsoDate(value: string): Date {
   const [year, month, day] = value.slice(0, 10).split('-').map(Number)
-  return new Date(year, (month ?? 1) - 1, day ?? 1)
+  return new Date(year, (month ?? 1) + 1, day ?? 1)
 }
 
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: expected { Object (from, to) } to deeply equal { Object (from, to) }

[Killed] BlockStatement
lib/event-filters.ts:49:47
 }
 
 /** The other way round: local Date to `YYYY-MM-DD`. */
-export function toIsoDate(date: Date): string {
-  const month = String(date.getMonth() + 1).padStart(2, '0')
-  const day = String(date.getDate()).padStart(2, '0')
-  return `${date.getFullYear()}-${month}-${day}`
-}
+export function toIsoDate(date: Date): string {}
 
 function addDays(date: Date, days: number): Date {
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: expected { from: '2026-09-16', to: undefined } to deeply equal { Object (from, to) }

[Killed] ArithmeticOperator
lib/event-filters.ts:50:24
 
 /** The other way round: local Date to `YYYY-MM-DD`. */
 export function toIsoDate(date: Date): string {
-  const month = String(date.getMonth() + 1).padStart(2, '0')
+  const month = String(date.getMonth() - 1).padStart(2, '0')
   const day = String(date.getDate()).padStart(2, '0')
   return `${date.getFullYear()}-${month}-${day}`
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: expected { Object (from, to) } to deeply equal { Object (from, to) }

[Killed] BlockStatement
lib/event-filters.ts:55:50
   return `${date.getFullYear()}-${month}-${day}`
 }
 
-function addDays(date: Date, days: number): Date {
-  const next = new Date(date)
-  next.setDate(next.getDate() + days)
-  return next
-}
+function addDays(date: Date, days: number): Date {}
 
 /**
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: Cannot read properties of undefined (reading 'getMonth')

[Killed] ArithmeticOperator
lib/event-filters.ts:57:16
 
 function addDays(date: Date, days: number): Date {
   const next = new Date(date)
-  next.setDate(next.getDate() + days)
+  next.setDate(next.getDate() - days)
   return next
 }
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: expected { Object (from, to) } to deeply equal { Object (from, to) }

[Killed] MethodExpression
lib/event-filters.ts:57:3
 
 function addDays(date: Date, days: number): Date {
   const next = new Date(date)
-  next.setDate(next.getDate() + days)
+  next.setTime(next.getDate() + days)
   return next
 }
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: expected { Object (from, to) } to deeply equal { Object (from, to) }

[Killed] EqualityOperator
lib/event-filters.ts:69:7
  * Sunday — if it is already the weekend, that means this one, not the next.
  */
 export function rangeBounds(range: TimeRange, today: string): { from: string; to: string } | null {
-  if (range === 'all') return null
+  if (range !== 'all') return null
 
   const start = parseIsoDate(today)
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: expected null to deeply equal { Object (from, to) }

[Killed] ConditionalExpression
lib/event-filters.ts:69:7
  * Sunday — if it is already the weekend, that means this one, not the next.
  */
 export function rangeBounds(range: TimeRange, today: string): { from: string; to: string } | null {
-  if (range === 'all') return null
+  if (true) return null
 
   const start = parseIsoDate(today)
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: expected null to deeply equal { Object (from, to) }

[Killed] ArithmeticOperator
lib/event-filters.ts:73:19
 
   const start = parseIsoDate(today)
   // getDay(): 0 = Sunday. We want 0 = Monday.
-  const weekday = (start.getDay() + 6) % 7
+  const weekday = (start.getDay() + 6) * 7
 
   switch (range) {
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: expected { Object (from, to) } to deeply equal { Object (from, to) }

[Killed] ArithmeticOperator
lib/event-filters.ts:73:20
 
   const start = parseIsoDate(today)
   // getDay(): 0 = Sunday. We want 0 = Monday.
-  const weekday = (start.getDay() + 6) % 7
+  const weekday = (start.getDay() - 6) % 7
 
   switch (range) {
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: expected { Object (from, to) } to deeply equal { Object (from, to) }

[NoCoverage] ConditionalExpression
lib/event-filters.ts:76:5
   const weekday = (start.getDay() + 6) % 7
 
   switch (range) {
-    case 'tonight':
-      return { from: today, to: today }
+    case 'tonight':
 
     case 'this-weekend': {

[NoCoverage] ObjectLiteral
lib/event-filters.ts:77:14
 
   switch (range) {
     case 'tonight':
-      return { from: today, to: today }
+      return {}
 
     case 'this-weekend': {

[Survived] BlockStatement
lib/event-filters.ts:79:26
     case 'tonight':
       return { from: today, to: today }
 
-    case 'this-weekend': {
-      // Friday = 4. Past Friday means the weekend is already under way.
-      const daysToFriday = weekday <= 4 ? 4 - weekday : 0
-      const friday = addDays(start, daysToFriday)
-      const sunday = addDays(start, 6 - weekday)
-      return { from: toIsoDate(friday > start ? friday : start), to: toIsoDate(sunday) }
-    }
+    case 'this-weekend': {}
 
     case 'this-week':

[Survived] ConditionalExpression
lib/event-filters.ts:79:5
     case 'tonight':
       return { from: today, to: today }
 
-    case 'this-weekend': {
-      // Friday = 4. Past Friday means the weekend is already under way.
-      const daysToFriday = weekday <= 4 ? 4 - weekday : 0
-      const friday = addDays(start, daysToFriday)
-      const sunday = addDays(start, 6 - weekday)
-      return { from: toIsoDate(friday > start ? friday : start), to: toIsoDate(sunday) }
-    }
+    case 'this-weekend':
 
     case 'this-week':

[Survived] EqualityOperator
lib/event-filters.ts:81:28
 
     case 'this-weekend': {
       // Friday = 4. Past Friday means the weekend is already under way.
-      const daysToFriday = weekday <= 4 ? 4 - weekday : 0
+      const daysToFriday = weekday > 4 ? 4 - weekday : 0
       const friday = addDays(start, daysToFriday)
       const sunday = addDays(start, 6 - weekday)

[Survived] EqualityOperator
lib/event-filters.ts:81:28
 
     case 'this-weekend': {
       // Friday = 4. Past Friday means the weekend is already under way.
-      const daysToFriday = weekday <= 4 ? 4 - weekday : 0
+      const daysToFriday = weekday < 4 ? 4 - weekday : 0
       const friday = addDays(start, daysToFriday)
       const sunday = addDays(start, 6 - weekday)

[Killed] ArithmeticOperator
lib/event-filters.ts:83:37
       // Friday = 4. Past Friday means the weekend is already under way.
       const daysToFriday = weekday <= 4 ? 4 - weekday : 0
       const friday = addDays(start, daysToFriday)
-      const sunday = addDays(start, 6 - weekday)
+      const sunday = addDays(start, 6 + weekday)
       return { from: toIsoDate(friday > start ? friday : start), to: toIsoDate(sunday) }
     }
killedBy: event date filters uses the current weekend when today is Saturday
statusReason: expected { Object (from, to) } to deeply equal { Object (from, to) }

[Survived] EqualityOperator
lib/event-filters.ts:84:32
       const daysToFriday = weekday <= 4 ? 4 - weekday : 0
       const friday = addDays(start, daysToFriday)
       const sunday = addDays(start, 6 - weekday)
-      return { from: toIsoDate(friday > start ? friday : start), to: toIsoDate(sunday) }
+      return { from: toIsoDate(friday >= start ? friday : start), to: toIsoDate(sunday) }
     }
 

[Survived] ConditionalExpression
lib/event-filters.ts:84:32
       const daysToFriday = weekday <= 4 ? 4 - weekday : 0
       const friday = addDays(start, daysToFriday)
       const sunday = addDays(start, 6 - weekday)
-      return { from: toIsoDate(friday > start ? friday : start), to: toIsoDate(sunday) }
+      return { from: toIsoDate(true ? friday : start), to: toIsoDate(sunday) }
     }
 

[Killed] ConditionalExpression
lib/event-filters.ts:87:5
       return { from: toIsoDate(friday > start ? friday : start), to: toIsoDate(sunday) }
     }
 
-    case 'this-week':
-      return { from: today, to: toIsoDate(addDays(start, 6 - weekday)) }
+    case 'this-week':
 
     case 'this-month': {
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: expected { Object (from, to) } to deeply equal { Object (from, to) }

[Killed] StringLiteral
lib/event-filters.ts:87:10
       return { from: toIsoDate(friday > start ? friday : start), to: toIsoDate(sunday) }
     }
 
-    case 'this-week':
+    case "":
       return { from: today, to: toIsoDate(addDays(start, 6 - weekday)) }
 
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: expected undefined to deeply equal { Object (from, to) }

[Killed] ArithmeticOperator
lib/event-filters.ts:88:58
     }
 
     case 'this-week':
-      return { from: today, to: toIsoDate(addDays(start, 6 - weekday)) }
+      return { from: today, to: toIsoDate(addDays(start, 6 + weekday)) }
 
     case 'this-month': {
killedBy: event date filters calculates the remaining Monday-to-Sunday week
statusReason: expected { Object (from, to) } to deeply equal { Object (from, to) }

[NoCoverage] ConditionalExpression
lib/event-filters.ts:90:5
     case 'this-week':
       return { from: today, to: toIsoDate(addDays(start, 6 - weekday)) }
 
-    case 'this-month': {
-      const lastDay = new Date(start.getFullYear(), start.getMonth() + 1, 0)
-      return { from: today, to: toIsoDate(lastDay) }
-    }
+    case 'this-month':
   }
 }

[NoCoverage] BlockStatement
lib/event-filters.ts:90:24
     case 'this-week':
       return { from: today, to: toIsoDate(addDays(start, 6 - weekday)) }
 
-    case 'this-month': {
-      const lastDay = new Date(start.getFullYear(), start.getMonth() + 1, 0)
-      return { from: today, to: toIsoDate(lastDay) }
-    }
+    case 'this-month': {}
   }
 }

[NoCoverage] ArithmeticOperator
lib/event-filters.ts:91:53
       return { from: today, to: toIsoDate(addDays(start, 6 - weekday)) }
 
     case 'this-month': {
-      const lastDay = new Date(start.getFullYear(), start.getMonth() + 1, 0)
+      const lastDay = new Date(start.getFullYear(), start.getMonth() - 1, 0)
       return { from: today, to: toIsoDate(lastDay) }
     }

[Killed] BlockStatement
lib/event-filters.ts:97:87
   }
 }
 
-export function isInRange(showDate: string, range: TimeRange, today: string): boolean {
-  const bounds = rangeBounds(range, today)
-  if (!bounds) return true
-  const date = showDate.slice(0, 10)
-  return date >= bounds.from && date <= bounds.to
-}
+export function isInRange(showDate: string, range: TimeRange, today: string): boolean {}
 
 /**
killedBy: event date filters checks inclusive range boundaries
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
lib/event-filters.ts:99:7
 
 export function isInRange(showDate: string, range: TimeRange, today: string): boolean {
   const bounds = rangeBounds(range, today)
-  if (!bounds) return true
+  if (bounds) return true
   const date = showDate.slice(0, 10)
   return date >= bounds.from && date <= bounds.to
killedBy: event date filters checks inclusive range boundaries
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
lib/event-filters.ts:99:7
 
 export function isInRange(showDate: string, range: TimeRange, today: string): boolean {
   const bounds = rangeBounds(range, today)
-  if (!bounds) return true
+  if (true) return true
   const date = showDate.slice(0, 10)
   return date >= bounds.from && date <= bounds.to
killedBy: event date filters checks inclusive range boundaries
statusReason: expected true to be false // Object.is equality

[Survived] MethodExpression
lib/event-filters.ts:100:16
 export function isInRange(showDate: string, range: TimeRange, today: string): boolean {
   const bounds = rangeBounds(range, today)
   if (!bounds) return true
-  const date = showDate.slice(0, 10)
+  const date = showDate
   return date >= bounds.from && date <= bounds.to
 }

[Killed] LogicalOperator
lib/event-filters.ts:101:10
   const bounds = rangeBounds(range, today)
   if (!bounds) return true
   const date = showDate.slice(0, 10)
-  return date >= bounds.from && date <= bounds.to
+  return date >= bounds.from || date <= bounds.to
 }
 
killedBy: event date filters checks inclusive range boundaries
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
lib/event-filters.ts:101:10
   const bounds = rangeBounds(range, today)
   if (!bounds) return true
   const date = showDate.slice(0, 10)
-  return date >= bounds.from && date <= bounds.to
+  return date < bounds.from && date <= bounds.to
 }
 
killedBy: event date filters checks inclusive range boundaries
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/event-filters.ts:108:73
  * "Today", "Tomorrow", otherwise "Wed 21 Aug" — used on the card's first
  * line, where date and time sit together.
  */
-export function formatDayLabel(showDate: string, today: string): string {
-  const date = showDate.slice(0, 10)
-  if (date === today) return 'Today'
-  if (date === toIsoDate(addDays(parseIsoDate(today), 1))) return 'Tomorrow'
-
-  return new Intl.DateTimeFormat('en-GB', {
-    weekday: 'short',
-    day: 'numeric',
-    month: 'short',
-  }).format(parseIsoDate(date))
-}
+export function formatDayLabel(showDate: string, today: string): string {}
 
killedBy: event date filters labels today and tomorrow without a UTC conversion
statusReason: expected undefined to be 'Today' // Object.is equality

[Survived] MethodExpression
lib/event-filters.ts:109:16
  * line, where date and time sit together.
  */
 export function formatDayLabel(showDate: string, today: string): string {
-  const date = showDate.slice(0, 10)
+  const date = showDate
   if (date === today) return 'Today'
   if (date === toIsoDate(addDays(parseIsoDate(today), 1))) return 'Tomorrow'

[Killed] ConditionalExpression
lib/event-filters.ts:110:7
  */
 export function formatDayLabel(showDate: string, today: string): string {
   const date = showDate.slice(0, 10)
-  if (date === today) return 'Today'
+  if (false) return 'Today'
   if (date === toIsoDate(addDays(parseIsoDate(today), 1))) return 'Tomorrow'
 
killedBy: event date filters labels today and tomorrow without a UTC conversion
statusReason: expected 'Wed 16 Sept' to be 'Today' // Object.is equality

[Killed] EqualityOperator
lib/event-filters.ts:110:7
  */
 export function formatDayLabel(showDate: string, today: string): string {
   const date = showDate.slice(0, 10)
-  if (date === today) return 'Today'
+  if (date !== today) return 'Today'
   if (date === toIsoDate(addDays(parseIsoDate(today), 1))) return 'Tomorrow'
 
killedBy: event date filters labels today and tomorrow without a UTC conversion
statusReason: expected 'Wed 16 Sept' to be 'Today' // Object.is equality

[Killed] ConditionalExpression
lib/event-filters.ts:111:7
 export function formatDayLabel(showDate: string, today: string): string {
   const date = showDate.slice(0, 10)
   if (date === today) return 'Today'
-  if (date === toIsoDate(addDays(parseIsoDate(today), 1))) return 'Tomorrow'
+  if (false) return 'Tomorrow'
 
   return new Intl.DateTimeFormat('en-GB', {
killedBy: event date filters labels today and tomorrow without a UTC conversion
statusReason: expected 'Thu 17 Sept' to be 'Tomorrow' // Object.is equality

[Killed] EqualityOperator
lib/event-filters.ts:111:7
 export function formatDayLabel(showDate: string, today: string): string {
   const date = showDate.slice(0, 10)
   if (date === today) return 'Today'
-  if (date === toIsoDate(addDays(parseIsoDate(today), 1))) return 'Tomorrow'
+  if (date !== toIsoDate(addDays(parseIsoDate(today), 1))) return 'Tomorrow'
 
   return new Intl.DateTimeFormat('en-GB', {
killedBy: event date filters labels today and tomorrow without a UTC conversion
statusReason: expected 'Thu 17 Sept' to be 'Tomorrow' // Object.is equality

[NoCoverage] StringLiteral
lib/event-filters.ts:113:34
   if (date === today) return 'Today'
   if (date === toIsoDate(addDays(parseIsoDate(today), 1))) return 'Tomorrow'
 
-  return new Intl.DateTimeFormat('en-GB', {
+  return new Intl.DateTimeFormat("", {
     weekday: 'short',
     day: 'numeric',

[NoCoverage] StringLiteral
lib/event-filters.ts:114:14
   if (date === toIsoDate(addDays(parseIsoDate(today), 1))) return 'Tomorrow'
 
   return new Intl.DateTimeFormat('en-GB', {
-    weekday: 'short',
+    weekday: "",
     day: 'numeric',
     month: 'short',
