[Killed] BlockStatement
lib/marketing/copy.ts:32:59
   lineup: Array<{ name: string; roleLabel: string | null }>
 }
 
-export function formatNorwegianDate(date: string): string {
-  const parsed = new Date(`${date}T12:00:00`)
-  if (Number.isNaN(parsed.getTime())) return date
-  return `${WEEKDAYS_NB[parsed.getDay()]} ${parsed.getDate()}. ${MONTHS_NB[parsed.getMonth()]} ${parsed.getFullYear()}`
-}
+export function formatNorwegianDate(date: string): string {}
 
 function timeLabel(startTime: string | null) {
killedBy: marketing copy formats a valid date in Norwegian
statusReason: expected undefined to be 'fredag 18. september 2026' // Object.is equality

[Killed] ConditionalExpression
lib/marketing/copy.ts:34:7
 
 export function formatNorwegianDate(date: string): string {
   const parsed = new Date(`${date}T12:00:00`)
-  if (Number.isNaN(parsed.getTime())) return date
+  if (true) return date
   return `${WEEKDAYS_NB[parsed.getDay()]} ${parsed.getDate()}. ${MONTHS_NB[parsed.getMonth()]} ${parsed.getFullYear()}`
 }
killedBy: marketing copy formats a valid date in Norwegian
statusReason: expected '2026-09-18' to be 'fredag 18. september 2026' // Object.is equality

[Killed] ConditionalExpression
lib/marketing/copy.ts:34:7
 
 export function formatNorwegianDate(date: string): string {
   const parsed = new Date(`${date}T12:00:00`)
-  if (Number.isNaN(parsed.getTime())) return date
+  if (false) return date
   return `${WEEKDAYS_NB[parsed.getDay()]} ${parsed.getDate()}. ${MONTHS_NB[parsed.getMonth()]} ${parsed.getFullYear()}`
 }
killedBy: marketing copy preserves an invalid date rather than inventing one
statusReason: expected 'undefined NaN. undefined NaN' to be 'not-a-date' // Object.is equality

[Killed] StringLiteral
lib/marketing/copy.ts:35:10
 export function formatNorwegianDate(date: string): string {
   const parsed = new Date(`${date}T12:00:00`)
   if (Number.isNaN(parsed.getTime())) return date
-  return `${WEEKDAYS_NB[parsed.getDay()]} ${parsed.getDate()}. ${MONTHS_NB[parsed.getMonth()]} ${parsed.getFullYear()}`
+  return ``
 }
 
killedBy: marketing copy formats a valid date in Norwegian
statusReason: expected '' to be 'fredag 18. september 2026' // Object.is equality

[Killed] BlockStatement
lib/marketing/copy.ts:38:46
   return `${WEEKDAYS_NB[parsed.getDay()]} ${parsed.getDate()}. ${MONTHS_NB[parsed.getMonth()]} ${parsed.getFullYear()}`
 }
 
-function timeLabel(startTime: string | null) {
-  return startTime ? `kl. ${startTime.slice(0, 5)}` : null
-}
+function timeLabel(startTime: string | null) {}
 
 /** Lang tekst — beskrivelsesfeltet på Facebook-eventet. */
killedBy: marketing copy includes required event information fredag 18. september 2026, kl. 20:30
statusReason: expected 'A sharp night of stand-up.\n\nLINEUP\…' to contain 'fredag 18. september 2026, kl. 20:30'

[Survived] MethodExpression
lib/marketing/copy.ts:39:29
 }
 
 function timeLabel(startTime: string | null) {
-  return startTime ? `kl. ${startTime.slice(0, 5)}` : null
+  return startTime ? `kl. ${startTime}` : null
 }
 

[Killed] BlockStatement
lib/marketing/copy.ts:43:77
 }
 
 /** Lang tekst — beskrivelsesfeltet på Facebook-eventet. */
-export function facebookEventDescription(input: MarketingCopyInput): string {
-  const headliners = input.lineup.filter((entry) => entry.roleLabel?.toLowerCase().includes('headliner'))
-  const rest = input.lineup.filter((entry) => !headliners.includes(entry))
-
-  return [
-    input.description?.trim() || `${input.title} — en kveld med stand-up.`,
-    '',
-    'LINEUP',
-    ...[...headliners, ...rest].map((entry) => (
-      entry.roleLabel ? `• ${entry.name} (${entry.roleLabel})` : `• ${entry.name}`
-    )),
-    input.lineup.length === 0 ? '• Lineup annonseres snart' : null,
-    '',
-    'PRAKTISK',
-    `• ${formatNorwegianDate(input.date)}${timeLabel(input.startTime) ? `, ${timeLabel(input.startTime)}` : ''}`,
-    input.venue ? `• ${input.venue}${input.city ? `, ${input.city}` : ''}` : null,
-    input.priceLabel ? `• Billetter fra ${input.priceLabel}` : null,
-    '',
-    input.ticketUrl ? `Billetter: ${input.ticketUrl}` : null,
-  ]
-    .filter((line) => line !== null)
-    .join('\n')
-    .replace(/\n{3,}/g, '\n\n')
-    .trim()
-}
+export function facebookEventDescription(input: MarketingCopyInput): string {}
 
 /** Kort tekst — bildeteksten under SoMe-posten. */
killedBy: marketing copy puts headliners first in the event description
statusReason: Cannot read properties of undefined (reading 'indexOf')

[Killed] MethodExpression
lib/marketing/copy.ts:44:53
 
 /** Lang tekst — beskrivelsesfeltet på Facebook-eventet. */
 export function facebookEventDescription(input: MarketingCopyInput): string {
-  const headliners = input.lineup.filter((entry) => entry.roleLabel?.toLowerCase().includes('headliner'))
+  const headliners = input.lineup.filter((entry) => entry.roleLabel?.toUpperCase().includes('headliner'))
   const rest = input.lineup.filter((entry) => !headliners.includes(entry))
 
killedBy: marketing copy puts headliners first in the event description
statusReason: expected 63 to be less than 37

[Killed] ArrowFunction
lib/marketing/copy.ts:44:42
 
 /** Lang tekst — beskrivelsesfeltet på Facebook-eventet. */
 export function facebookEventDescription(input: MarketingCopyInput): string {
-  const headliners = input.lineup.filter((entry) => entry.roleLabel?.toLowerCase().includes('headliner'))
+  const headliners = input.lineup.filter(() => undefined)
   const rest = input.lineup.filter((entry) => !headliners.includes(entry))
 
killedBy: marketing copy puts headliners first in the event description
statusReason: expected 63 to be less than 37

[Killed] ArrowFunction
lib/marketing/copy.ts:45:36
 /** Lang tekst — beskrivelsesfeltet på Facebook-eventet. */
 export function facebookEventDescription(input: MarketingCopyInput): string {
   const headliners = input.lineup.filter((entry) => entry.roleLabel?.toLowerCase().includes('headliner'))
-  const rest = input.lineup.filter((entry) => !headliners.includes(entry))
+  const rest = input.lineup.filter(() => undefined)
 
   return [
killedBy: marketing copy puts headliners first in the event description
statusReason: expected 37 to be less than -1

[Killed] BooleanLiteral
lib/marketing/copy.ts:45:47
 /** Lang tekst — beskrivelsesfeltet på Facebook-eventet. */
 export function facebookEventDescription(input: MarketingCopyInput): string {
   const headliners = input.lineup.filter((entry) => entry.roleLabel?.toLowerCase().includes('headliner'))
-  const rest = input.lineup.filter((entry) => !headliners.includes(entry))
+  const rest = input.lineup.filter((entry) => headliners.includes(entry))
 
   return [
killedBy: marketing copy puts headliners first in the event description
statusReason: expected 37 to be less than -1

[Killed] ConditionalExpression
lib/marketing/copy.ts:48:5
   const rest = input.lineup.filter((entry) => !headliners.includes(entry))
 
   return [
-    input.description?.trim() || `${input.title} — en kveld med stand-up.`,
+    false,
     '',
     'LINEUP',
killedBy: marketing copy includes required event information A sharp night of stand-up.
statusReason: expected 'false\n\nLINEUP\n• Main Name (Headlin…' to contain 'A sharp night of stand-up.'

[Killed] MethodExpression
lib/marketing/copy.ts:48:5
   const rest = input.lineup.filter((entry) => !headliners.includes(entry))
 
   return [
-    input.description?.trim() || `${input.title} — en kveld med stand-up.`,
+    input.description || `${input.title} — en kveld med stand-up.`,
     '',
     'LINEUP',
killedBy: marketing copy uses safe fallback copy and lineup placeholder
statusReason: expected 'LINEUP\n• Lineup annonseres snart\n\n…' to contain 'Friday Laughs — en kveld med stand-up.'

[Killed] StringLiteral
lib/marketing/copy.ts:50:5
   return [
     input.description?.trim() || `${input.title} — en kveld med stand-up.`,
     '',
-    'LINEUP',
+    "",
     ...[...headliners, ...rest].map((entry) => (
       entry.roleLabel ? `• ${entry.name} (${entry.roleLabel})` : `• ${entry.name}`
killedBy: marketing copy includes required event information LINEUP
statusReason: expected 'A sharp night of stand-up.\n\n• Main …' to contain 'LINEUP'

[Killed] ArrowFunction
lib/marketing/copy.ts:51:37
     input.description?.trim() || `${input.title} — en kveld med stand-up.`,
     '',
     'LINEUP',
-    ...[...headliners, ...rest].map((entry) => (
-      entry.roleLabel ? `• ${entry.name} (${entry.roleLabel})` : `• ${entry.name}`
-    )),
+    ...[...headliners, ...rest].map(() => undefined),
     input.lineup.length === 0 ? '• Lineup annonseres snart' : null,
     '',
killedBy: marketing copy puts headliners first in the event description
statusReason: expected -1 to be less than -1

[Killed] ArrayDeclaration
lib/marketing/copy.ts:51:8
     input.description?.trim() || `${input.title} — en kveld med stand-up.`,
     '',
     'LINEUP',
-    ...[...headliners, ...rest].map((entry) => (
+    ...[].map((entry) => (
       entry.roleLabel ? `• ${entry.name} (${entry.roleLabel})` : `• ${entry.name}`
     )),
killedBy: marketing copy puts headliners first in the event description
statusReason: expected -1 to be less than -1

[Killed] EqualityOperator
lib/marketing/copy.ts:54:5
     ...[...headliners, ...rest].map((entry) => (
       entry.roleLabel ? `• ${entry.name} (${entry.roleLabel})` : `• ${entry.name}`
     )),
-    input.lineup.length === 0 ? '• Lineup annonseres snart' : null,
+    input.lineup.length !== 0 ? '• Lineup annonseres snart' : null,
     '',
     'PRAKTISK',
killedBy: marketing copy uses safe fallback copy and lineup placeholder
statusReason: expected 'Friday Laughs — en kveld med stand-up…' to contain '• Lineup annonseres snart'

[Killed] ConditionalExpression
lib/marketing/copy.ts:54:5
     ...[...headliners, ...rest].map((entry) => (
       entry.roleLabel ? `• ${entry.name} (${entry.roleLabel})` : `• ${entry.name}`
     )),
-    input.lineup.length === 0 ? '• Lineup annonseres snart' : null,
+    false ? '• Lineup annonseres snart' : null,
     '',
     'PRAKTISK',
killedBy: marketing copy uses safe fallback copy and lineup placeholder
statusReason: expected 'Friday Laughs — en kveld med stand-up…' to contain '• Lineup annonseres snart'

[Survived] StringLiteral
lib/marketing/copy.ts:55:5
       entry.roleLabel ? `• ${entry.name} (${entry.roleLabel})` : `• ${entry.name}`
     )),
     input.lineup.length === 0 ? '• Lineup annonseres snart' : null,
-    '',
+    "Stryker was here!",
     'PRAKTISK',
     `• ${formatNorwegianDate(input.date)}${timeLabel(input.startTime) ? `, ${timeLabel(input.startTime)}` : ''}`,

[Killed] StringLiteral
lib/marketing/copy.ts:57:73
     input.lineup.length === 0 ? '• Lineup annonseres snart' : null,
     '',
     'PRAKTISK',
-    `• ${formatNorwegianDate(input.date)}${timeLabel(input.startTime) ? `, ${timeLabel(input.startTime)}` : ''}`,
+    `• ${formatNorwegianDate(input.date)}${timeLabel(input.startTime) ? `` : ''}`,
     input.venue ? `• ${input.venue}${input.city ? `, ${input.city}` : ''}` : null,
     input.priceLabel ? `• Billetter fra ${input.priceLabel}` : null,
killedBy: marketing copy includes required event information fredag 18. september 2026, kl. 20:30
statusReason: expected 'A sharp night of stand-up.\n\nLINEUP\…' to contain 'fredag 18. september 2026, kl. 20:30'

[Killed] StringLiteral
lib/marketing/copy.ts:57:5
     input.lineup.length === 0 ? '• Lineup annonseres snart' : null,
     '',
     'PRAKTISK',
-    `• ${formatNorwegianDate(input.date)}${timeLabel(input.startTime) ? `, ${timeLabel(input.startTime)}` : ''}`,
+    ``,
     input.venue ? `• ${input.venue}${input.city ? `, ${input.city}` : ''}` : null,
     input.priceLabel ? `• Billetter fra ${input.priceLabel}` : null,
killedBy: marketing copy includes required event information fredag 18. september 2026, kl. 20:30
statusReason: expected 'A sharp night of stand-up.\n\nLINEUP\…' to contain 'fredag 18. september 2026, kl. 20:30'

[Killed] StringLiteral
lib/marketing/copy.ts:58:51
     '',
     'PRAKTISK',
     `• ${formatNorwegianDate(input.date)}${timeLabel(input.startTime) ? `, ${timeLabel(input.startTime)}` : ''}`,
-    input.venue ? `• ${input.venue}${input.city ? `, ${input.city}` : ''}` : null,
+    input.venue ? `• ${input.venue}${input.city ? `` : ''}` : null,
     input.priceLabel ? `• Billetter fra ${input.priceLabel}` : null,
     '',
killedBy: marketing copy includes required event information • Comedy House, Oslo
statusReason: expected 'A sharp night of stand-up.\n\nLINEUP\…' to contain '• Comedy House, Oslo'

[Survived] StringLiteral
lib/marketing/copy.ts:60:5
     `• ${formatNorwegianDate(input.date)}${timeLabel(input.startTime) ? `, ${timeLabel(input.startTime)}` : ''}`,
     input.venue ? `• ${input.venue}${input.city ? `, ${input.city}` : ''}` : null,
     input.priceLabel ? `• Billetter fra ${input.priceLabel}` : null,
-    '',
+    "Stryker was here!",
     input.ticketUrl ? `Billetter: ${input.ticketUrl}` : null,
   ]

[Killed] StringLiteral
lib/marketing/copy.ts:61:23
     input.venue ? `• ${input.venue}${input.city ? `, ${input.city}` : ''}` : null,
     input.priceLabel ? `• Billetter fra ${input.priceLabel}` : null,
     '',
-    input.ticketUrl ? `Billetter: ${input.ticketUrl}` : null,
+    input.ticketUrl ? `` : null,
   ]
     .filter((line) => line !== null)
killedBy: marketing copy includes required event information Billetter: https://tickethalo.com/events/friday-laughs
statusReason: expected 'A sharp night of stand-up.\n\nLINEUP\…' to contain 'Billetter: https://tickethalo.com/eve…'

[Killed] ConditionalExpression
lib/marketing/copy.ts:63:23
     '',
     input.ticketUrl ? `Billetter: ${input.ticketUrl}` : null,
   ]
-    .filter((line) => line !== null)
+    .filter((line) => false)
     .join('\n')
     .replace(/\n{3,}/g, '\n\n')
killedBy: marketing copy puts headliners first in the event description
statusReason: expected -1 to be less than -1

[Killed] ArrowFunction
lib/marketing/copy.ts:63:13
     '',
     input.ticketUrl ? `Billetter: ${input.ticketUrl}` : null,
   ]
-    .filter((line) => line !== null)
+    .filter(() => undefined)
     .join('\n')
     .replace(/\n{3,}/g, '\n\n')
killedBy: marketing copy puts headliners first in the event description
statusReason: expected -1 to be less than -1

[Survived] StringLiteral
lib/marketing/copy.ts:64:11
     input.ticketUrl ? `Billetter: ${input.ticketUrl}` : null,
   ]
     .filter((line) => line !== null)
-    .join('\n')
+    .join("")
     .replace(/\n{3,}/g, '\n\n')
     .trim()

[Killed] BlockStatement
lib/marketing/copy.ts:70:66
 }
 
 /** Kort tekst — bildeteksten under SoMe-posten. */
-export function socialCaption(input: MarketingCopyInput): string {
-  const names = input.lineup.map((entry) => entry.name)
-  const nameLine = names.length > 0
-    ? names.length === 1 ? names[0] : `${names.slice(0, -1).join(', ')} og ${names[names.length - 1]}`
-    : null
-
-  return [
-    `${input.title.toUpperCase()} 🎤`,
-    nameLine,
-    `${formatNorwegianDate(input.date)}${timeLabel(input.startTime) ? ` ${timeLabel(input.startTime)}` : ''}${input.venue ? ` · ${input.venue}` : ''}`,
-    input.ticketUrl ? `Billetter i bio / ${input.ticketUrl}` : 'Billetter i bio',
-  ]
-    .filter(Boolean)
-    .join('\n')
-}
+export function socialCaption(input: MarketingCopyInput): string {}
 
 /** Tittelfeltet på Facebook-eventet. */
killedBy: marketing copy creates a compact caption with natural name joining
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArrowFunction
lib/marketing/copy.ts:71:34
 
 /** Kort tekst — bildeteksten under SoMe-posten. */
 export function socialCaption(input: MarketingCopyInput): string {
-  const names = input.lineup.map((entry) => entry.name)
+  const names = input.lineup.map(() => undefined)
   const nameLine = names.length > 0
     ? names.length === 1 ? names[0] : `${names.slice(0, -1).join(', ')} og ${names[names.length - 1]}`
killedBy: marketing copy creates a compact caption with natural name joining
statusReason: expected 'FRIDAY LAUGHS 🎤\n og undefined\nfred…' to contain 'Support Star og Main Name'

[Killed] ConditionalExpression
lib/marketing/copy.ts:72:20
 /** Kort tekst — bildeteksten under SoMe-posten. */
 export function socialCaption(input: MarketingCopyInput): string {
   const names = input.lineup.map((entry) => entry.name)
-  const nameLine = names.length > 0
+  const nameLine = false
     ? names.length === 1 ? names[0] : `${names.slice(0, -1).join(', ')} og ${names[names.length - 1]}`
     : null
killedBy: marketing copy creates a compact caption with natural name joining
statusReason: expected 'FRIDAY LAUGHS 🎤\nfredag 18. septembe…' to contain 'Support Star og Main Name'

[Killed] EqualityOperator
lib/marketing/copy.ts:72:20
 /** Kort tekst — bildeteksten under SoMe-posten. */
 export function socialCaption(input: MarketingCopyInput): string {
   const names = input.lineup.map((entry) => entry.name)
-  const nameLine = names.length > 0
+  const nameLine = names.length <= 0
     ? names.length === 1 ? names[0] : `${names.slice(0, -1).join(', ')} og ${names[names.length - 1]}`
     : null
killedBy: marketing copy creates a compact caption with natural name joining
statusReason: expected 'FRIDAY LAUGHS 🎤\nfredag 18. septembe…' to contain 'Support Star og Main Name'

[Killed] ConditionalExpression
lib/marketing/copy.ts:73:7
 export function socialCaption(input: MarketingCopyInput): string {
   const names = input.lineup.map((entry) => entry.name)
   const nameLine = names.length > 0
-    ? names.length === 1 ? names[0] : `${names.slice(0, -1).join(', ')} og ${names[names.length - 1]}`
+    ? true ? names[0] : `${names.slice(0, -1).join(', ')} og ${names[names.length - 1]}`
     : null
 
killedBy: marketing copy creates a compact caption with natural name joining
statusReason: expected 'FRIDAY LAUGHS 🎤\nSupport Star\nfreda…' to contain 'Support Star og Main Name'

[Killed] EqualityOperator
lib/marketing/copy.ts:73:7
 export function socialCaption(input: MarketingCopyInput): string {
   const names = input.lineup.map((entry) => entry.name)
   const nameLine = names.length > 0
-    ? names.length === 1 ? names[0] : `${names.slice(0, -1).join(', ')} og ${names[names.length - 1]}`
+    ? names.length !== 1 ? names[0] : `${names.slice(0, -1).join(', ')} og ${names[names.length - 1]}`
     : null
 
killedBy: marketing copy creates a compact caption with natural name joining
statusReason: expected 'FRIDAY LAUGHS 🎤\nSupport Star\nfreda…' to contain 'Support Star og Main Name'

[Survived] MethodExpression
lib/marketing/copy.ts:77:8
     : null
 
   return [
-    `${input.title.toUpperCase()} 🎤`,
+    `${input.title.toLowerCase()} 🎤`,
     nameLine,
     `${formatNorwegianDate(input.date)}${timeLabel(input.startTime) ? ` ${timeLabel(input.startTime)}` : ''}${input.venue ? ` · ${input.venue}` : ''}`,

[Killed] StringLiteral
lib/marketing/copy.ts:77:5
     : null
 
   return [
-    `${input.title.toUpperCase()} 🎤`,
+    ``
     nameLine,
     `${formatNorwegianDate(input.date)}${timeLabel(input.startTime) ? ` ${timeLabel(input.startTime)}` : ''}${input.venue ? ` · ${input.venue}` : ''}`,
killedBy: marketing copy handles one artist without a conjunction
statusReason: expected 'Solo\nfredag 18. september 2026 kl. 2…' to contain '\nSolo\n'

[NoCoverage] StringLiteral
lib/marketing/copy.ts:79:106
   return [
     `${input.title.toUpperCase()} 🎤`,
     nameLine,
-    `${formatNorwegianDate(input.date)}${timeLabel(input.startTime) ? ` ${timeLabel(input.startTime)}` : ''}${input.venue ? ` · ${input.venue}` : ''}`,
+    `${formatNorwegianDate(input.date)}${timeLabel(input.startTime) ? ` ${timeLabel(input.startTime)}` : "Stryker was here!"}${input.venue ? ` · ${input.venue}` : ''}`,
     input.ticketUrl ? `Billetter i bio / ${input.ticketUrl}` : 'Billetter i bio',
   ]

[Killed] StringLiteral
lib/marketing/copy.ts:83:11
     input.ticketUrl ? `Billetter i bio / ${input.ticketUrl}` : 'Billetter i bio',
   ]
     .filter(Boolean)
-    .join('\n')
+    .join("")
 }
 
killedBy: marketing copy handles one artist without a conjunction
statusReason: expected 'FRIDAY LAUGHS 🎤Solofredag 18. septem…' to contain '\nSolo\n'

[Killed] BlockStatement
lib/marketing/copy.ts:87:71
 }
 
 /** Tittelfeltet på Facebook-eventet. */
-export function facebookEventTitle(input: MarketingCopyInput): string {
-  const headliner = input.lineup.find((entry) => entry.roleLabel?.toLowerCase().includes('headliner'))
-  return headliner ? `${input.title} — ${headliner.name}` : input.title
-}
+export function facebookEventTitle(input: MarketingCopyInput): string {}
 
killedBy: marketing copy adds the headliner to the Facebook title
statusReason: expected undefined to be 'Friday Laughs — Main Name' // Object.is equality

[Killed] ArrowFunction
lib/marketing/copy.ts:88:39
 
 /** Tittelfeltet på Facebook-eventet. */
 export function facebookEventTitle(input: MarketingCopyInput): string {
-  const headliner = input.lineup.find((entry) => entry.roleLabel?.toLowerCase().includes('headliner'))
+  const headliner = input.lineup.find(() => undefined)
   return headliner ? `${input.title} — ${headliner.name}` : input.title
 }
killedBy: marketing copy adds the headliner to the Facebook title
statusReason: expected 'Friday Laughs' to be 'Friday Laughs — Main Name' // Object.is equality

[Killed] MethodExpression
lib/marketing/copy.ts:88:50
 
 /** Tittelfeltet på Facebook-eventet. */
 export function facebookEventTitle(input: MarketingCopyInput): string {
-  const headliner = input.lineup.find((entry) => entry.roleLabel?.toLowerCase().includes('headliner'))
+  const headliner = input.lineup.find((entry) => entry.roleLabel?.toUpperCase().includes('headliner'))
   return headliner ? `${input.title} — ${headliner.name}` : input.title
 }
killedBy: marketing copy adds the headliner to the Facebook title
statusReason: expected 'Friday Laughs' to be 'Friday Laughs — Main Name' // Object.is equality

[Killed] StringLiteral
lib/marketing/copy.ts:89:22
 /** Tittelfeltet på Facebook-eventet. */
 export function facebookEventTitle(input: MarketingCopyInput): string {
   const headliner = input.lineup.find((entry) => entry.roleLabel?.toLowerCase().includes('headliner'))
-  return headliner ? `${input.title} — ${headliner.name}` : input.title
+  return headliner ? `` : input.title
 }
 
killedBy: marketing copy adds the headliner to the Facebook title
statusReason: expected '' to be 'Friday Laughs — Main Name' // Object.is equality
