[Killed] BlockStatement
lib/marketing/palette.ts:39:61
   { key: 'accent', label: 'Accent', hint: 'Blikkfang — dato, pris og billettlenke.' },
 ] as const satisfies ReadonlyArray<{ key: keyof MarketingPalette; label: string; hint: string }>
 
-export function isHexColor(value: unknown): value is string {
-  return typeof value === 'string' && parseHexColor(value) !== null
-}
+export function isHexColor(value: unknown): value is string {}
 
 /** Normaliserer «#ABC», «abcdef» og liknende til «#aabbcc». */
killedBy: marketing palette accepts hex color #fff
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
lib/marketing/palette.ts:40:10
 ] as const satisfies ReadonlyArray<{ key: keyof MarketingPalette; label: string; hint: string }>
 
 export function isHexColor(value: unknown): value is string {
-  return typeof value === 'string' && parseHexColor(value) !== null
+  return typeof value === 'string' || parseHexColor(value) !== null
 }
 
killedBy: marketing palette rejects non-hex color 123
statusReason: value.trim is not a function

[Killed] EqualityOperator
lib/marketing/palette.ts:40:39
 ] as const satisfies ReadonlyArray<{ key: keyof MarketingPalette; label: string; hint: string }>
 
 export function isHexColor(value: unknown): value is string {
-  return typeof value === 'string' && parseHexColor(value) !== null
+  return typeof value === 'string' && parseHexColor(value) === null
 }
 
killedBy: marketing palette accepts hex color #fff
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/marketing/palette.ts:44:90
 }
 
 /** Normaliserer «#ABC», «abcdef» og liknende til «#aabbcc». */
-export function normalizeHex(value: string | null | undefined, fallback: string): string {
-  const parsed = parseHexColor(value)
-  return parsed ? toHexColor(parsed) : fallback
-}
+export function normalizeHex(value: string | null | undefined, fallback: string): string {}
 
 /**
killedBy: marketing palette normalizes short and uppercase values
statusReason: expected undefined to be '#aabbcc' // Object.is equality

[Killed] BlockStatement
lib/marketing/palette.ts:57:84
  * skille seg fra primærfargen uten å bli det rene komplementet, som ofte
  * vibrerer stygt i trykk.
  */
-export function paletteFromSeed(seed: string | null | undefined): MarketingPalette {
-  const parsed = parseHexColor(seed) ?? parseHexColor(DEFAULT_MARKETING_SEED)!
-  const primary = normalizeBrandColor(parsed)
-  const { h, s } = rgbToHsl(primary)
-
-  const secondary = hslToRgb({
-    h: (h + 12) % 360,
-    s: Math.min(0.9, Math.max(0.35, s * 0.85)),
-    l: 0.16,
-  })
-
-  const accentBase = hslToRgb({
-    h: (h + 150) % 360,
-    s: Math.min(0.98, Math.max(0.6, s + 0.18)),
-    l: 0.54,
-  })
-
-  return {
-    primary: toHexColor(primary),
-    secondary: toHexColor(secondary),
-    accent: toHexColor(ensureContrast(accentBase, SURFACE_DARK, 3)),
-  }
-}
+export function paletteFromSeed(seed: string | null | undefined): MarketingPalette {}
 
 /**
killedBy: marketing palette creates a complete normalized palette from #ff0000
statusReason: Cannot convert undefined or null to object

[Killed] LogicalOperator
lib/marketing/palette.ts:58:18
  * vibrerer stygt i trykk.
  */
 export function paletteFromSeed(seed: string | null | undefined): MarketingPalette {
-  const parsed = parseHexColor(seed) ?? parseHexColor(DEFAULT_MARKETING_SEED)!
+  const parsed = parseHexColor(seed) && parseHexColor(DEFAULT_MARKETING_SEED)!
   const primary = normalizeBrandColor(parsed)
   const { h, s } = rgbToHsl(primary)
killedBy: marketing palette uses the default marketing seed when no seed exists
statusReason: Cannot destructure property 'r' of 'object null' as it is null.

[Killed] ObjectLiteral
lib/marketing/palette.ts:62:30
   const primary = normalizeBrandColor(parsed)
   const { h, s } = rgbToHsl(primary)
 
-  const secondary = hslToRgb({
-    h: (h + 12) % 360,
-    s: Math.min(0.9, Math.max(0.35, s * 0.85)),
-    l: 0.16,
-  })
+  const secondary = hslToRgb({})
 
   const accentBase = hslToRgb({
killedBy: marketing palette creates a complete normalized palette from #ff0000
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
lib/marketing/palette.ts:63:8
   const { h, s } = rgbToHsl(primary)
 
   const secondary = hslToRgb({
-    h: (h + 12) % 360,
+    h: (h + 12) * 360,
     s: Math.min(0.9, Math.max(0.35, s * 0.85)),
     l: 0.16,

[Survived] ArithmeticOperator
lib/marketing/palette.ts:63:9
   const { h, s } = rgbToHsl(primary)
 
   const secondary = hslToRgb({
-    h: (h + 12) % 360,
+    h: (h - 12) % 360,
     s: Math.min(0.9, Math.max(0.35, s * 0.85)),
     l: 0.16,

[Survived] ArithmeticOperator
lib/marketing/palette.ts:64:37
 
   const secondary = hslToRgb({
     h: (h + 12) % 360,
-    s: Math.min(0.9, Math.max(0.35, s * 0.85)),
+    s: Math.min(0.9, Math.max(0.35, s / 0.85)),
     l: 0.16,
   })

[Survived] MethodExpression
lib/marketing/palette.ts:64:8
 
   const secondary = hslToRgb({
     h: (h + 12) % 360,
-    s: Math.min(0.9, Math.max(0.35, s * 0.85)),
+    s: Math.max(0.9, Math.max(0.35, s * 0.85)),
     l: 0.16,
   })

[Survived] ArithmeticOperator
lib/marketing/palette.ts:69:9
   })
 
   const accentBase = hslToRgb({
-    h: (h + 150) % 360,
+    h: (h - 150) % 360,
     s: Math.min(0.98, Math.max(0.6, s + 0.18)),
     l: 0.54,

[Survived] ArithmeticOperator
lib/marketing/palette.ts:69:8
   })
 
   const accentBase = hslToRgb({
-    h: (h + 150) % 360,
+    h: (h + 150) * 360,
     s: Math.min(0.98, Math.max(0.6, s + 0.18)),
     l: 0.54,

[Survived] MethodExpression
lib/marketing/palette.ts:70:8
 
   const accentBase = hslToRgb({
     h: (h + 150) % 360,
-    s: Math.min(0.98, Math.max(0.6, s + 0.18)),
+    s: Math.max(0.98, Math.max(0.6, s + 0.18)),
     l: 0.54,
   })

[Survived] ArithmeticOperator
lib/marketing/palette.ts:70:37
 
   const accentBase = hslToRgb({
     h: (h + 150) % 360,
-    s: Math.min(0.98, Math.max(0.6, s + 0.18)),
+    s: Math.min(0.98, Math.max(0.6, s - 0.18)),
     l: 0.54,
   })

[Survived] ObjectLiteral
lib/marketing/palette.ts:74:10
     l: 0.54,
   })
 
-  return {
-    primary: toHexColor(primary),
-    secondary: toHexColor(secondary),
-    accent: toHexColor(ensureContrast(accentBase, SURFACE_DARK, 3)),
-  }
+  return {}
 }
 

[Survived] MethodExpression
lib/marketing/palette.ts:86:17
  * Er det bare én brukbar farge, faller de to andre tilbake på utledningen.
  */
 export function paletteFromColors(colors: string[]): MarketingPalette {
-  const valid = colors.filter(isHexColor)
+  const valid = colors
   if (valid.length === 0) return paletteFromSeed(DEFAULT_MARKETING_SEED)
 

[Killed] ConditionalExpression
lib/marketing/palette.ts:87:7
  */
 export function paletteFromColors(colors: string[]): MarketingPalette {
   const valid = colors.filter(isHexColor)
-  if (valid.length === 0) return paletteFromSeed(DEFAULT_MARKETING_SEED)
+  if (false) return paletteFromSeed(DEFAULT_MARKETING_SEED)
 
   const derived = paletteFromSeed(valid[0])
killedBy: marketing palette derives a palette when extracted colors are empty
statusReason: Cannot read properties of undefined (reading 'rgb')

[Killed] EqualityOperator
lib/marketing/palette.ts:87:7
  */
 export function paletteFromColors(colors: string[]): MarketingPalette {
   const valid = colors.filter(isHexColor)
-  if (valid.length === 0) return paletteFromSeed(DEFAULT_MARKETING_SEED)
+  if (valid.length !== 0) return paletteFromSeed(DEFAULT_MARKETING_SEED)
 
   const derived = paletteFromSeed(valid[0])
killedBy: marketing palette derives a palette when extracted colors are empty
statusReason: Cannot read properties of undefined (reading 'rgb')

[Survived] EqualityOperator
lib/marketing/palette.ts:90:7
   if (valid.length === 0) return paletteFromSeed(DEFAULT_MARKETING_SEED)
 
   const derived = paletteFromSeed(valid[0])
-  if (valid.length === 1) return derived
+  if (valid.length !== 1) return derived
 
   // Den mørkeste brukbare fargen blir sekundær, den mest kulørte som ikke er

[Survived] ConditionalExpression
lib/marketing/palette.ts:90:7
   if (valid.length === 0) return paletteFromSeed(DEFAULT_MARKETING_SEED)
 
   const derived = paletteFromSeed(valid[0])
-  if (valid.length === 1) return derived
+  if (false) return derived
 
   // Den mørkeste brukbare fargen blir sekundær, den mest kulørte som ikke er

[Killed] ArrowFunction
lib/marketing/palette.ts:94:26
 
   // Den mørkeste brukbare fargen blir sekundær, den mest kulørte som ikke er
   // primærfargen blir aksent. Da speiler paletten bildet i stedet for regelen.
-  const rgbs = valid.map((hex) => ({ hex, rgb: parseHexColor(hex)! }))
+  const rgbs = valid.map(() => undefined)
   const primary = rgbs[0]
   const rest = rgbs.slice(1)
killedBy: marketing palette uses extracted colors without mutating the input
statusReason: Cannot read properties of undefined (reading 'hex')

[Killed] ObjectLiteral
lib/marketing/palette.ts:94:36
 
   // Den mørkeste brukbare fargen blir sekundær, den mest kulørte som ikke er
   // primærfargen blir aksent. Da speiler paletten bildet i stedet for regelen.
-  const rgbs = valid.map((hex) => ({ hex, rgb: parseHexColor(hex)! }))
+  const rgbs = valid.map((hex) => ({}))
   const primary = rgbs[0]
   const rest = rgbs.slice(1)
killedBy: marketing palette uses extracted colors without mutating the input
statusReason: Cannot destructure property 'r' of 'undefined' as it is undefined.

[Survived] MethodExpression
lib/marketing/palette.ts:96:16
   // primærfargen blir aksent. Da speiler paletten bildet i stedet for regelen.
   const rgbs = valid.map((hex) => ({ hex, rgb: parseHexColor(hex)! }))
   const primary = rgbs[0]
-  const rest = rgbs.slice(1)
+  const rest = rgbs
 
   const darkest = [...rest].sort((a, b) => rgbToHsl(a.rgb).l - rgbToHsl(b.rgb).l)[0]

[Survived] ArrowFunction
lib/marketing/palette.ts:98:34
   const primary = rgbs[0]
   const rest = rgbs.slice(1)
 
-  const darkest = [...rest].sort((a, b) => rgbToHsl(a.rgb).l - rgbToHsl(b.rgb).l)[0]
+  const darkest = [...rest].sort(() => undefined)[0]
   const mostSaturated = [...rest]
     .filter((c) => c.hex !== darkest?.hex)

[Survived] MethodExpression
lib/marketing/palette.ts:98:19
   const primary = rgbs[0]
   const rest = rgbs.slice(1)
 
-  const darkest = [...rest].sort((a, b) => rgbToHsl(a.rgb).l - rgbToHsl(b.rgb).l)[0]
+  const darkest = [...rest][0]
   const mostSaturated = [...rest]
     .filter((c) => c.hex !== darkest?.hex)

[Survived] MethodExpression
lib/marketing/palette.ts:99:25
   const rest = rgbs.slice(1)
 
   const darkest = [...rest].sort((a, b) => rgbToHsl(a.rgb).l - rgbToHsl(b.rgb).l)[0]
-  const mostSaturated = [...rest]
-    .filter((c) => c.hex !== darkest?.hex)
+  const mostSaturated = [...rest]
     .sort((a, b) => rgbToHsl(b.rgb).s - rgbToHsl(a.rgb).s)[0]
 

[Survived] MethodExpression
lib/marketing/palette.ts:99:25
   const rest = rgbs.slice(1)
 
   const darkest = [...rest].sort((a, b) => rgbToHsl(a.rgb).l - rgbToHsl(b.rgb).l)[0]
-  const mostSaturated = [...rest]
-    .filter((c) => c.hex !== darkest?.hex)
-    .sort((a, b) => rgbToHsl(b.rgb).s - rgbToHsl(a.rgb).s)[0]
+  const mostSaturated = [...rest].filter(c => c.hex !== darkest?.hex)[0]
 
   const secondary = darkest && rgbToHsl(darkest.rgb).l < 0.42

[Survived] ConditionalExpression
lib/marketing/palette.ts:100:20
 
   const darkest = [...rest].sort((a, b) => rgbToHsl(a.rgb).l - rgbToHsl(b.rgb).l)[0]
   const mostSaturated = [...rest]
-    .filter((c) => c.hex !== darkest?.hex)
+    .filter((c) => true)
     .sort((a, b) => rgbToHsl(b.rgb).s - rgbToHsl(a.rgb).s)[0]
 

[Survived] OptionalChaining
lib/marketing/palette.ts:100:30
 
   const darkest = [...rest].sort((a, b) => rgbToHsl(a.rgb).l - rgbToHsl(b.rgb).l)[0]
   const mostSaturated = [...rest]
-    .filter((c) => c.hex !== darkest?.hex)
+    .filter((c) => c.hex !== darkest.hex)
     .sort((a, b) => rgbToHsl(b.rgb).s - rgbToHsl(a.rgb).s)[0]
 

[NoCoverage] ArithmeticOperator
lib/marketing/palette.ts:101:21
   const darkest = [...rest].sort((a, b) => rgbToHsl(a.rgb).l - rgbToHsl(b.rgb).l)[0]
   const mostSaturated = [...rest]
     .filter((c) => c.hex !== darkest?.hex)
-    .sort((a, b) => rgbToHsl(b.rgb).s - rgbToHsl(a.rgb).s)[0]
+    .sort((a, b) => rgbToHsl(b.rgb).s + rgbToHsl(a.rgb).s)[0]
 
   const secondary = darkest && rgbToHsl(darkest.rgb).l < 0.42

[Survived] ArrowFunction
lib/marketing/palette.ts:101:11
   const darkest = [...rest].sort((a, b) => rgbToHsl(a.rgb).l - rgbToHsl(b.rgb).l)[0]
   const mostSaturated = [...rest]
     .filter((c) => c.hex !== darkest?.hex)
-    .sort((a, b) => rgbToHsl(b.rgb).s - rgbToHsl(a.rgb).s)[0]
+    .sort(() => undefined)[0]
 
   const secondary = darkest && rgbToHsl(darkest.rgb).l < 0.42

[Survived] ConditionalExpression
lib/marketing/palette.ts:103:21
     .filter((c) => c.hex !== darkest?.hex)
     .sort((a, b) => rgbToHsl(b.rgb).s - rgbToHsl(a.rgb).s)[0]
 
-  const secondary = darkest && rgbToHsl(darkest.rgb).l < 0.42
+  const secondary = false
     ? toHexColor(hslToRgb({ ...rgbToHsl(darkest.rgb), l: Math.min(0.22, rgbToHsl(darkest.rgb).l) }))
     : derived.secondary

[Survived] EqualityOperator
lib/marketing/palette.ts:103:32
     .filter((c) => c.hex !== darkest?.hex)
     .sort((a, b) => rgbToHsl(b.rgb).s - rgbToHsl(a.rgb).s)[0]
 
-  const secondary = darkest && rgbToHsl(darkest.rgb).l < 0.42
+  const secondary = darkest && rgbToHsl(darkest.rgb).l <= 0.42
     ? toHexColor(hslToRgb({ ...rgbToHsl(darkest.rgb), l: Math.min(0.22, rgbToHsl(darkest.rgb).l) }))
     : derived.secondary

[Survived] MethodExpression
lib/marketing/palette.ts:104:58
     .sort((a, b) => rgbToHsl(b.rgb).s - rgbToHsl(a.rgb).s)[0]
 
   const secondary = darkest && rgbToHsl(darkest.rgb).l < 0.42
-    ? toHexColor(hslToRgb({ ...rgbToHsl(darkest.rgb), l: Math.min(0.22, rgbToHsl(darkest.rgb).l) }))
+    ? toHexColor(hslToRgb({ ...rgbToHsl(darkest.rgb), l: Math.max(0.22, rgbToHsl(darkest.rgb).l) }))
     : derived.secondary
 

[Survived] OptionalChaining
lib/marketing/palette.ts:107:27
     ? toHexColor(hslToRgb({ ...rgbToHsl(darkest.rgb), l: Math.min(0.22, rgbToHsl(darkest.rgb).l) }))
     : derived.secondary
 
-  const accentCandidate = mostSaturated?.rgb
+  const accentCandidate = mostSaturated.rgb
   const accent = accentCandidate && contrastRatio(accentCandidate, primary.rgb) > 1.6
     ? toHexColor(ensureContrast(accentCandidate, SURFACE_DARK, 3))

[Survived] LogicalOperator
lib/marketing/palette.ts:108:18
     : derived.secondary
 
   const accentCandidate = mostSaturated?.rgb
-  const accent = accentCandidate && contrastRatio(accentCandidate, primary.rgb) > 1.6
+  const accent = accentCandidate || contrastRatio(accentCandidate, primary.rgb) > 1.6
     ? toHexColor(ensureContrast(accentCandidate, SURFACE_DARK, 3))
     : derived.accent

[Survived] ConditionalExpression
lib/marketing/palette.ts:108:18
     : derived.secondary
 
   const accentCandidate = mostSaturated?.rgb
-  const accent = accentCandidate && contrastRatio(accentCandidate, primary.rgb) > 1.6
+  const accent = true
     ? toHexColor(ensureContrast(accentCandidate, SURFACE_DARK, 3))
     : derived.accent

[Killed] ObjectLiteral
lib/marketing/palette.ts:112:10
     ? toHexColor(ensureContrast(accentCandidate, SURFACE_DARK, 3))
     : derived.accent
 
-  return { primary: toHexColor(normalizeBrandColor(primary.rgb)), secondary, accent }
+  return {}
 }
 
killedBy: marketing palette uses extracted colors without mutating the input
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] BlockStatement
lib/marketing/palette.ts:119:21
 export function resolvePalette(
   stored: unknown,
   clubBrandColor?: string | null,
-): MarketingPalette {
-  const fallback = paletteFromSeed(clubBrandColor ?? DEFAULT_MARKETING_SEED)
-  if (!stored || typeof stored !== 'object') return fallback
-
-  const raw = stored as Partial<Record<keyof MarketingPalette, unknown>>
-  return {
-    primary: normalizeHex(raw.primary as string, fallback.primary),
-    secondary: normalizeHex(raw.secondary as string, fallback.secondary),
-    accent: normalizeHex(raw.accent as string, fallback.accent),
-  }
-}
+): MarketingPalette {}
 
 /** Tekstfargen som leser best oppå en av palettfargene. */
killedBy: marketing palette fills invalid stored fields from the club seed
statusReason: expected undefined to deeply equal { primary: '#abcdef', …(2) }

[Killed] LogicalOperator
lib/marketing/palette.ts:120:36
   stored: unknown,
   clubBrandColor?: string | null,
 ): MarketingPalette {
-  const fallback = paletteFromSeed(clubBrandColor ?? DEFAULT_MARKETING_SEED)
+  const fallback = paletteFromSeed(clubBrandColor && DEFAULT_MARKETING_SEED)
   if (!stored || typeof stored !== 'object') return fallback
 
killedBy: marketing palette fills invalid stored fields from the club seed
statusReason: expected { primary: '#abcdef', …(2) } to deeply equal { primary: '#abcdef', …(2) }

[Killed] BooleanLiteral
lib/marketing/palette.ts:121:7
   clubBrandColor?: string | null,
 ): MarketingPalette {
   const fallback = paletteFromSeed(clubBrandColor ?? DEFAULT_MARKETING_SEED)
-  if (!stored || typeof stored !== 'object') return fallback
+  if (stored || typeof stored !== 'object') return fallback
 
   const raw = stored as Partial<Record<keyof MarketingPalette, unknown>>
killedBy: marketing palette fills invalid stored fields from the club seed
statusReason: expected { primary: '#663399', …(2) } to deeply equal { primary: '#abcdef', …(2) }

[Killed] ConditionalExpression
lib/marketing/palette.ts:121:7
   clubBrandColor?: string | null,
 ): MarketingPalette {
   const fallback = paletteFromSeed(clubBrandColor ?? DEFAULT_MARKETING_SEED)
-  if (!stored || typeof stored !== 'object') return fallback
+  if (false) return fallback
 
   const raw = stored as Partial<Record<keyof MarketingPalette, unknown>>
killedBy: marketing palette resolves invalid stored palette null
statusReason: Cannot read properties of null (reading 'primary')

[Killed] ObjectLiteral
lib/marketing/palette.ts:124:10
   if (!stored || typeof stored !== 'object') return fallback
 
   const raw = stored as Partial<Record<keyof MarketingPalette, unknown>>
-  return {
-    primary: normalizeHex(raw.primary as string, fallback.primary),
-    secondary: normalizeHex(raw.secondary as string, fallback.secondary),
-    accent: normalizeHex(raw.accent as string, fallback.accent),
-  }
+  return {}
 }
 
killedBy: marketing palette fills invalid stored fields from the club seed
statusReason: expected {} to deeply equal { primary: '#abcdef', …(2) }

[Killed] BlockStatement
lib/marketing/palette.ts:132:44
 }
 
 /** Tekstfargen som leser best oppå en av palettfargene. */
-export function inkOn(hex: string): string {
-  const parsed = parseHexColor(hex)
-  return parsed ? toHexColor(readableInkOn(parsed)) : '#ffffff'
-}
+export function inkOn(hex: string): string {}
 
 /** `rgba(...)`-variant, til hårfine bakgrunner i admin-flaten. */
killedBy: marketing palette returns readable ink for valid and invalid colors
statusReason: expected undefined to be '#2e0c01' // Object.is equality

[Killed] StringLiteral
lib/marketing/palette.ts:134:55
 /** Tekstfargen som leser best oppå en av palettfargene. */
 export function inkOn(hex: string): string {
   const parsed = parseHexColor(hex)
-  return parsed ? toHexColor(readableInkOn(parsed)) : '#ffffff'
+  return parsed ? toHexColor(readableInkOn(parsed)) : ""
 }
 
killedBy: marketing palette returns readable ink for valid and invalid colors
statusReason: expected '' to be '#ffffff' // Object.is equality

[Killed] BlockStatement
lib/marketing/palette.ts:138:58
 }
 
 /** `rgba(...)`-variant, til hårfine bakgrunner i admin-flaten. */
-export function tint(hex: string, alpha: number): string {
-  const parsed = parseHexColor(hex)
-  if (!parsed) return 'transparent'
-  const { r, g, b } = parsed
-  return `rgba(${Math.round(r)}, ${Math.round(g)}, ${Math.round(b)}, ${alpha})`
-}
+export function tint(hex: string, alpha: number): string {}
 
 /** Palettens farger som en linje AI-en kan lese i plakatprompten. */
killedBy: marketing palette creates an rgba tint and rejects invalid input
statusReason: expected undefined to be 'rgba(51, 102, 153, 0.25)' // Object.is equality

[Killed] BooleanLiteral
lib/marketing/palette.ts:140:7
 /** `rgba(...)`-variant, til hårfine bakgrunner i admin-flaten. */
 export function tint(hex: string, alpha: number): string {
   const parsed = parseHexColor(hex)
-  if (!parsed) return 'transparent'
+  if (parsed) return 'transparent'
   const { r, g, b } = parsed
   return `rgba(${Math.round(r)}, ${Math.round(g)}, ${Math.round(b)}, ${alpha})`
killedBy: marketing palette creates an rgba tint and rejects invalid input
statusReason: expected 'transparent' to be 'rgba(51, 102, 153, 0.25)' // Object.is equality

[Killed] ConditionalExpression
lib/marketing/palette.ts:140:7
 /** `rgba(...)`-variant, til hårfine bakgrunner i admin-flaten. */
 export function tint(hex: string, alpha: number): string {
   const parsed = parseHexColor(hex)
-  if (!parsed) return 'transparent'
+  if (true) return 'transparent'
   const { r, g, b } = parsed
   return `rgba(${Math.round(r)}, ${Math.round(g)}, ${Math.round(b)}, ${alpha})`
killedBy: marketing palette creates an rgba tint and rejects invalid input
statusReason: expected 'transparent' to be 'rgba(51, 102, 153, 0.25)' // Object.is equality

[Killed] BlockStatement
lib/marketing/palette.ts:146:70
 }
 
 /** Palettens farger som en linje AI-en kan lese i plakatprompten. */
-export function palettePromptLine(palette: MarketingPalette): string {
-  return [
-    `Primary surface colour ${palette.primary}`,
-    `secondary/dark colour ${palette.secondary}`,
-    `accent colour ${palette.accent} for date, price and ticket call-to-action`,
-  ].join(', ')
-}
+export function palettePromptLine(palette: MarketingPalette): string {}
 
killedBy: marketing palette writes all roles into an AI-readable prompt line
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
lib/marketing/palette.ts:148:5
 /** Palettens farger som en linje AI-en kan lese i plakatprompten. */
 export function palettePromptLine(palette: MarketingPalette): string {
   return [
-    `Primary surface colour ${palette.primary}`,
+    ``,
     `secondary/dark colour ${palette.secondary}`,
     `accent colour ${palette.accent} for date, price and ticket call-to-action`,
killedBy: marketing palette writes all roles into an AI-readable prompt line
statusReason: expected ', secondary/dark colour #222222, acce…' to contain 'Primary surface colour #111111'

[Killed] StringLiteral
lib/marketing/palette.ts:150:5
   return [
     `Primary surface colour ${palette.primary}`,
     `secondary/dark colour ${palette.secondary}`,
-    `accent colour ${palette.accent} for date, price and ticket call-to-action`,
+    ``,
   ].join(', ')
 }
killedBy: marketing palette writes all roles into an AI-readable prompt line
statusReason: expected 'Primary surface colour #111111, secon…' to contain 'accent colour #333333'
