[Killed] BlockStatement
lib/marketing/slots.ts:72:82
 
 const ACTIVE_SPOT_STATUSES = new Set(['confirmed', 'completed', 'paid'])
 
-export function artistDisplayName(artist: SlotArtist | undefined | null): string {
-  if (!artist) return 'Unknown artist'
-  return artist.stage_name ?? artist.full_name
-}
+export function artistDisplayName(artist: SlotArtist | undefined | null): string {}
 
 /**
killedBy: marketing slot matching prefers stage name and handles unknown artists
statusReason: expected undefined to be 'Helen' // Object.is equality

[Killed] BooleanLiteral
lib/marketing/slots.ts:73:7
 const ACTIVE_SPOT_STATUSES = new Set(['confirmed', 'completed', 'paid'])
 
 export function artistDisplayName(artist: SlotArtist | undefined | null): string {
-  if (!artist) return 'Unknown artist'
+  if (artist) return 'Unknown artist'
   return artist.stage_name ?? artist.full_name
 }
killedBy: marketing slot matching prefers stage name and handles unknown artists
statusReason: expected 'Unknown artist' to be 'Helen' // Object.is equality

[Killed] ConditionalExpression
lib/marketing/slots.ts:73:7
 const ACTIVE_SPOT_STATUSES = new Set(['confirmed', 'completed', 'paid'])
 
 export function artistDisplayName(artist: SlotArtist | undefined | null): string {
-  if (!artist) return 'Unknown artist'
+  if (true) return 'Unknown artist'
   return artist.stage_name ?? artist.full_name
 }
killedBy: marketing slot matching prefers stage name and handles unknown artists
statusReason: expected 'Unknown artist' to be 'Helen' // Object.is equality

[Killed] LogicalOperator
lib/marketing/slots.ts:74:10
 
 export function artistDisplayName(artist: SlotArtist | undefined | null): string {
   if (!artist) return 'Unknown artist'
-  return artist.stage_name ?? artist.full_name
+  return artist.stage_name && artist.full_name
 }
 
killedBy: marketing slot matching prefers stage name and handles unknown artists
statusReason: expected 'Helen Head' to be 'Helen' // Object.is equality

[Killed] BlockStatement
lib/marketing/slots.ts:82:79
  * Rekkefølgen er stabil, så en ny artist på en støttespot flytter ikke
  * headlinerens bilde.
  */
-function rankRequirements(requirements: SlotRequirement[]): SlotRequirement[] {
-  return [...requirements].sort((a, b) => {
-    const rankA = ROLE_RANK[normalizeArtistRole(a.role_name) ?? ''] ?? 9
-    const rankB = ROLE_RANK[normalizeArtistRole(b.role_name) ?? ''] ?? 9
-    if (rankA !== rankB) return rankA - rankB
-    if (a.lineup_position !== b.lineup_position) return a.lineup_position - b.lineup_position
-    return a.id.localeCompare(b.id)
-  })
-}
+function rankRequirements(requirements: SlotRequirement[]): SlotRequirement[] {}
 
 function slotLabel(roleName: string, indexWithinRole: number, totalForRole: number): string {
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: rankRequirements is not a function or its return value is not iterable

[Killed] MethodExpression
lib/marketing/slots.ts:83:10
  * headlinerens bilde.
  */
 function rankRequirements(requirements: SlotRequirement[]): SlotRequirement[] {
-  return [...requirements].sort((a, b) => {
-    const rankA = ROLE_RANK[normalizeArtistRole(a.role_name) ?? ''] ?? 9
-    const rankB = ROLE_RANK[normalizeArtistRole(b.role_name) ?? ''] ?? 9
-    if (rankA !== rankB) return rankA - rankB
-    if (a.lineup_position !== b.lineup_position) return a.lineup_position - b.lineup_position
-    return a.id.localeCompare(b.id)
-  })
+  return [...requirements]
 }
 
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'support', 'head', 'host' ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] BlockStatement
lib/marketing/slots.ts:83:43
  * headlinerens bilde.
  */
 function rankRequirements(requirements: SlotRequirement[]): SlotRequirement[] {
-  return [...requirements].sort((a, b) => {
-    const rankA = ROLE_RANK[normalizeArtistRole(a.role_name) ?? ''] ?? 9
-    const rankB = ROLE_RANK[normalizeArtistRole(b.role_name) ?? ''] ?? 9
-    if (rankA !== rankB) return rankA - rankB
-    if (a.lineup_position !== b.lineup_position) return a.lineup_position - b.lineup_position
-    return a.id.localeCompare(b.id)
-  })
+  return [...requirements].sort((a, b) => {})
 }
 
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'support', 'head', 'host' ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] LogicalOperator
lib/marketing/slots.ts:84:29
  */
 function rankRequirements(requirements: SlotRequirement[]): SlotRequirement[] {
   return [...requirements].sort((a, b) => {
-    const rankA = ROLE_RANK[normalizeArtistRole(a.role_name) ?? ''] ?? 9
+    const rankA = ROLE_RANK[normalizeArtistRole(a.role_name) && ''] ?? 9
     const rankB = ROLE_RANK[normalizeArtistRole(b.role_name) ?? ''] ?? 9
     if (rankA !== rankB) return rankA - rankB
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'support', 'head', 'host' ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] LogicalOperator
lib/marketing/slots.ts:84:19
  */
 function rankRequirements(requirements: SlotRequirement[]): SlotRequirement[] {
   return [...requirements].sort((a, b) => {
-    const rankA = ROLE_RANK[normalizeArtistRole(a.role_name) ?? ''] ?? 9
+    const rankA = ROLE_RANK[normalizeArtistRole(a.role_name) ?? ''] && 9
     const rankB = ROLE_RANK[normalizeArtistRole(b.role_name) ?? ''] ?? 9
     if (rankA !== rankB) return rankA - rankB
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'head', 'support', 'host' ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] LogicalOperator
lib/marketing/slots.ts:85:29
 function rankRequirements(requirements: SlotRequirement[]): SlotRequirement[] {
   return [...requirements].sort((a, b) => {
     const rankA = ROLE_RANK[normalizeArtistRole(a.role_name) ?? ''] ?? 9
-    const rankB = ROLE_RANK[normalizeArtistRole(b.role_name) ?? ''] ?? 9
+    const rankB = ROLE_RANK[normalizeArtistRole(b.role_name) && ''] ?? 9
     if (rankA !== rankB) return rankA - rankB
     if (a.lineup_position !== b.lineup_position) return a.lineup_position - b.lineup_position
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'host', 'head', 'support' ] to deeply equal [ 'head', 'host', 'support' ]

[Survived] LogicalOperator
lib/marketing/slots.ts:85:19
 function rankRequirements(requirements: SlotRequirement[]): SlotRequirement[] {
   return [...requirements].sort((a, b) => {
     const rankA = ROLE_RANK[normalizeArtistRole(a.role_name) ?? ''] ?? 9
-    const rankB = ROLE_RANK[normalizeArtistRole(b.role_name) ?? ''] ?? 9
+    const rankB = ROLE_RANK[normalizeArtistRole(b.role_name) ?? ''] && 9
     if (rankA !== rankB) return rankA - rankB
     if (a.lineup_position !== b.lineup_position) return a.lineup_position - b.lineup_position

[Killed] ConditionalExpression
lib/marketing/slots.ts:86:9
   return [...requirements].sort((a, b) => {
     const rankA = ROLE_RANK[normalizeArtistRole(a.role_name) ?? ''] ?? 9
     const rankB = ROLE_RANK[normalizeArtistRole(b.role_name) ?? ''] ?? 9
-    if (rankA !== rankB) return rankA - rankB
+    if (false) return rankA - rankB
     if (a.lineup_position !== b.lineup_position) return a.lineup_position - b.lineup_position
     return a.id.localeCompare(b.id)
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'support', 'host', 'head' ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] ArithmeticOperator
lib/marketing/slots.ts:86:33
   return [...requirements].sort((a, b) => {
     const rankA = ROLE_RANK[normalizeArtistRole(a.role_name) ?? ''] ?? 9
     const rankB = ROLE_RANK[normalizeArtistRole(b.role_name) ?? ''] ?? 9
-    if (rankA !== rankB) return rankA - rankB
+    if (rankA !== rankB) return rankA + rankB
     if (a.lineup_position !== b.lineup_position) return a.lineup_position - b.lineup_position
     return a.id.localeCompare(b.id)
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'support', 'head', 'host' ] to deeply equal [ 'head', 'host', 'support' ]

[NoCoverage] ConditionalExpression
lib/marketing/slots.ts:87:9
     const rankA = ROLE_RANK[normalizeArtistRole(a.role_name) ?? ''] ?? 9
     const rankB = ROLE_RANK[normalizeArtistRole(b.role_name) ?? ''] ?? 9
     if (rankA !== rankB) return rankA - rankB
-    if (a.lineup_position !== b.lineup_position) return a.lineup_position - b.lineup_position
+    if (true) return a.lineup_position - b.lineup_position
     return a.id.localeCompare(b.id)
   })

[NoCoverage] EqualityOperator
lib/marketing/slots.ts:87:9
     const rankA = ROLE_RANK[normalizeArtistRole(a.role_name) ?? ''] ?? 9
     const rankB = ROLE_RANK[normalizeArtistRole(b.role_name) ?? ''] ?? 9
     if (rankA !== rankB) return rankA - rankB
-    if (a.lineup_position !== b.lineup_position) return a.lineup_position - b.lineup_position
+    if (a.lineup_position === b.lineup_position) return a.lineup_position - b.lineup_position
     return a.id.localeCompare(b.id)
   })

[Killed] BlockStatement
lib/marketing/slots.ts:92:93
   })
 }
 
-function slotLabel(roleName: string, indexWithinRole: number, totalForRole: number): string {
-  const canonical = normalizeArtistRole(roleName)
-  const base = canonical === 'headliner' ? 'Headliner'
-    : canonical === 'konferansier' ? 'Host'
-    : canonical === 'stand-up' ? 'Stand-up'
-    : canonical === 'open mic' ? 'Open Mic'
-    : roleName
-  return totalForRole > 1 ? `${base} ${indexWithinRole + 1}` : base
-}
+function slotLabel(roleName: string, indexWithinRole: number, totalForRole: number): string {}
 
 /**
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ undefined, undefined, undefined ] to deeply equal [ 'Headliner', 'Host', 'Stand-up' ]

[Killed] ConditionalExpression
lib/marketing/slots.ts:94:16
 
 function slotLabel(roleName: string, indexWithinRole: number, totalForRole: number): string {
   const canonical = normalizeArtistRole(roleName)
-  const base = canonical === 'headliner' ? 'Headliner'
+  const base = true ? 'Headliner'
     : canonical === 'konferansier' ? 'Host'
     : canonical === 'stand-up' ? 'Stand-up'
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'Headliner', 'Headliner', …(1) ] to deeply equal [ 'Headliner', 'Host', 'Stand-up' ]

[Killed] EqualityOperator
lib/marketing/slots.ts:94:16
 
 function slotLabel(roleName: string, indexWithinRole: number, totalForRole: number): string {
   const canonical = normalizeArtistRole(roleName)
-  const base = canonical === 'headliner' ? 'Headliner'
+  const base = canonical !== 'headliner' ? 'Headliner'
     : canonical === 'konferansier' ? 'Host'
     : canonical === 'stand-up' ? 'Stand-up'
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'Headliner', 'Headliner', …(1) ] to deeply equal [ 'Headliner', 'Host', 'Stand-up' ]

[Killed] ConditionalExpression
lib/marketing/slots.ts:95:7
 function slotLabel(roleName: string, indexWithinRole: number, totalForRole: number): string {
   const canonical = normalizeArtistRole(roleName)
   const base = canonical === 'headliner' ? 'Headliner'
-    : canonical === 'konferansier' ? 'Host'
+    : false ? 'Host'
     : canonical === 'stand-up' ? 'Stand-up'
     : canonical === 'open mic' ? 'Open Mic'
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'Headliner', 'MC', 'Stand-up' ] to deeply equal [ 'Headliner', 'Host', 'Stand-up' ]

[Killed] ConditionalExpression
lib/marketing/slots.ts:95:7
 function slotLabel(roleName: string, indexWithinRole: number, totalForRole: number): string {
   const canonical = normalizeArtistRole(roleName)
   const base = canonical === 'headliner' ? 'Headliner'
-    : canonical === 'konferansier' ? 'Host'
+    : true ? 'Host'
     : canonical === 'stand-up' ? 'Stand-up'
     : canonical === 'open mic' ? 'Open Mic'
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'Headliner', 'Host', 'Host' ] to deeply equal [ 'Headliner', 'Host', 'Stand-up' ]

[Survived] ConditionalExpression
lib/marketing/slots.ts:96:7
   const canonical = normalizeArtistRole(roleName)
   const base = canonical === 'headliner' ? 'Headliner'
     : canonical === 'konferansier' ? 'Host'
-    : canonical === 'stand-up' ? 'Stand-up'
+    : false ? 'Stand-up'
     : canonical === 'open mic' ? 'Open Mic'
     : roleName

[Survived] ConditionalExpression
lib/marketing/slots.ts:96:7
   const canonical = normalizeArtistRole(roleName)
   const base = canonical === 'headliner' ? 'Headliner'
     : canonical === 'konferansier' ? 'Host'
-    : canonical === 'stand-up' ? 'Stand-up'
+    : true ? 'Stand-up'
     : canonical === 'open mic' ? 'Open Mic'
     : roleName

[NoCoverage] ConditionalExpression
lib/marketing/slots.ts:97:7
   const base = canonical === 'headliner' ? 'Headliner'
     : canonical === 'konferansier' ? 'Host'
     : canonical === 'stand-up' ? 'Stand-up'
-    : canonical === 'open mic' ? 'Open Mic'
+    : false ? 'Open Mic'
     : roleName
   return totalForRole > 1 ? `${base} ${indexWithinRole + 1}` : base

[NoCoverage] ConditionalExpression
lib/marketing/slots.ts:97:7
   const base = canonical === 'headliner' ? 'Headliner'
     : canonical === 'konferansier' ? 'Host'
     : canonical === 'stand-up' ? 'Stand-up'
-    : canonical === 'open mic' ? 'Open Mic'
+    : true ? 'Open Mic'
     : roleName
   return totalForRole > 1 ? `${base} ${indexWithinRole + 1}` : base

[Killed] EqualityOperator
lib/marketing/slots.ts:99:10
     : canonical === 'stand-up' ? 'Stand-up'
     : canonical === 'open mic' ? 'Open Mic'
     : roleName
-  return totalForRole > 1 ? `${base} ${indexWithinRole + 1}` : base
+  return totalForRole >= 1 ? `${base} ${indexWithinRole + 1}` : base
 }
 
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'Headliner 1', 'Host 1', …(1) ] to deeply equal [ 'Headliner', 'Host', 'Stand-up' ]

[Killed] EqualityOperator
lib/marketing/slots.ts:99:10
     : canonical === 'stand-up' ? 'Stand-up'
     : canonical === 'open mic' ? 'Open Mic'
     : roleName
-  return totalForRole > 1 ? `${base} ${indexWithinRole + 1}` : base
+  return totalForRole <= 1 ? `${base} ${indexWithinRole + 1}` : base
 }
 
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'Headliner 1', 'Host 1', …(1) ] to deeply equal [ 'Headliner', 'Host', 'Stand-up' ]

[Killed] ArrowFunction
lib/marketing/slots.ts:116:48
   stored?: StoredSlot[]
   templateSlotCount?: number | null
 }): MarketingSlot[] {
-  const artistById = new Map(input.artists.map((artist) => [artist.id, artist]))
+  const artistById = new Map(input.artists.map(() => undefined))
   const storedByIndex = new Map((input.stored ?? []).map((slot) => [slot.slot_index, slot]))
   const activeSpots = input.spots.filter((spot) => ACTIVE_SPOT_STATUSES.has(spot.status))
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: Iterator value undefined is not an entry object

[Killed] LogicalOperator
lib/marketing/slots.ts:117:34
   templateSlotCount?: number | null
 }): MarketingSlot[] {
   const artistById = new Map(input.artists.map((artist) => [artist.id, artist]))
-  const storedByIndex = new Map((input.stored ?? []).map((slot) => [slot.slot_index, slot]))
+  const storedByIndex = new Map((input.stored && []).map((slot) => [slot.slot_index, slot]))
   const activeSpots = input.spots.filter((spot) => ACTIVE_SPOT_STATUSES.has(spot.status))
 
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
lib/marketing/slots.ts:117:58
   templateSlotCount?: number | null
 }): MarketingSlot[] {
   const artistById = new Map(input.artists.map((artist) => [artist.id, artist]))
-  const storedByIndex = new Map((input.stored ?? []).map((slot) => [slot.slot_index, slot]))
+  const storedByIndex = new Map((input.stored ?? []).map(() => undefined))
   const activeSpots = input.spots.filter((spot) => ACTIVE_SPOT_STATUSES.has(spot.status))
 
killedBy: marketing slot matching lets a manual artist override automatic matching
statusReason: Iterator value undefined is not an entry object

[Killed] MethodExpression
lib/marketing/slots.ts:118:23
 }): MarketingSlot[] {
   const artistById = new Map(input.artists.map((artist) => [artist.id, artist]))
   const storedByIndex = new Map((input.stored ?? []).map((slot) => [slot.slot_index, slot]))
-  const activeSpots = input.spots.filter((spot) => ACTIVE_SPOT_STATUSES.has(spot.status))
+  const activeSpots = input.spots
 
   const spotsByRequirement = new Map<string, SlotSpot[]>()
killedBy: marketing slot matching ignores cancelled spots
statusReason: expected 'head' to be null

[Killed] ArrowFunction
lib/marketing/slots.ts:118:42
 }): MarketingSlot[] {
   const artistById = new Map(input.artists.map((artist) => [artist.id, artist]))
   const storedByIndex = new Map((input.stored ?? []).map((slot) => [slot.slot_index, slot]))
-  const activeSpots = input.spots.filter((spot) => ACTIVE_SPOT_STATUSES.has(spot.status))
+  const activeSpots = input.spots.filter(() => undefined)
 
   const spotsByRequirement = new Map<string, SlotSpot[]>()
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ null, null, null ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] BlockStatement
lib/marketing/slots.ts:121:35
   const activeSpots = input.spots.filter((spot) => ACTIVE_SPOT_STATUSES.has(spot.status))
 
   const spotsByRequirement = new Map<string, SlotSpot[]>()
-  for (const spot of activeSpots) {
-    const bucket = spotsByRequirement.get(spot.show_requirement_id)
-    if (bucket) bucket.push(spot)
-    else spotsByRequirement.set(spot.show_requirement_id, [spot])
-  }
+  for (const spot of activeSpots) {}
 
   const planned: Array<{ roleLabel: string; artistId: string | null }> = []
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ null, null, null, 'support', …(2) ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] ConditionalExpression
lib/marketing/slots.ts:123:9
   const spotsByRequirement = new Map<string, SlotSpot[]>()
   for (const spot of activeSpots) {
     const bucket = spotsByRequirement.get(spot.show_requirement_id)
-    if (bucket) bucket.push(spot)
+    if (true) bucket.push(spot)
     else spotsByRequirement.set(spot.show_requirement_id, [spot])
   }
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: Cannot read properties of undefined (reading 'push')

[Survived] ConditionalExpression
lib/marketing/slots.ts:123:9
   const spotsByRequirement = new Map<string, SlotSpot[]>()
   for (const spot of activeSpots) {
     const bucket = spotsByRequirement.get(spot.show_requirement_id)
-    if (bucket) bucket.push(spot)
+    if (false) bucket.push(spot)
     else spotsByRequirement.set(spot.show_requirement_id, [spot])
   }

[Killed] ArrayDeclaration
lib/marketing/slots.ts:127:74
     else spotsByRequirement.set(spot.show_requirement_id, [spot])
   }
 
-  const planned: Array<{ roleLabel: string; artistId: string | null }> = []
+  const planned: Array<{ roleLabel: string; artistId: string | null }> = ["Stryker was here"]
   for (const requirement of rankRequirements(input.requirements)) {
     const filled = spotsByRequirement.get(requirement.id) ?? []
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ null, 'head', 'host', 'support' ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] BlockStatement
lib/marketing/slots.ts:128:67
   }
 
   const planned: Array<{ roleLabel: string; artistId: string | null }> = []
-  for (const requirement of rankRequirements(input.requirements)) {
-    const filled = spotsByRequirement.get(requirement.id) ?? []
-    const total = Math.max(requirement.quantity, filled.length)
-    for (let index = 0; index < total; index++) {
-      planned.push({
-        roleLabel: slotLabel(requirement.role_name, index, total),
-        artistId: filled[index]?.artist_id ?? null,
-      })
-    }
-  }
+  for (const requirement of rankRequirements(input.requirements)) {}
 
   // Artister som er bekreftet på et krav som er slettet siden, skal ikke
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'support', 'head', 'host' ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] LogicalOperator
lib/marketing/slots.ts:129:20
 
   const planned: Array<{ roleLabel: string; artistId: string | null }> = []
   for (const requirement of rankRequirements(input.requirements)) {
-    const filled = spotsByRequirement.get(requirement.id) ?? []
+    const filled = spotsByRequirement.get(requirement.id) && []
     const total = Math.max(requirement.quantity, filled.length)
     for (let index = 0; index < total; index++) {
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ null, null, null, 'support', …(2) ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] MethodExpression
lib/marketing/slots.ts:130:19
   const planned: Array<{ roleLabel: string; artistId: string | null }> = []
   for (const requirement of rankRequirements(input.requirements)) {
     const filled = spotsByRequirement.get(requirement.id) ?? []
-    const total = Math.max(requirement.quantity, filled.length)
+    const total = Math.min(requirement.quantity, filled.length)
     for (let index = 0; index < total; index++) {
       planned.push({
killedBy: marketing slot matching ignores cancelled spots
statusReason: Cannot read properties of undefined (reading 'artistId')

[Killed] BlockStatement
lib/marketing/slots.ts:131:49
   for (const requirement of rankRequirements(input.requirements)) {
     const filled = spotsByRequirement.get(requirement.id) ?? []
     const total = Math.max(requirement.quantity, filled.length)
-    for (let index = 0; index < total; index++) {
-      planned.push({
-        roleLabel: slotLabel(requirement.role_name, index, total),
-        artistId: filled[index]?.artist_id ?? null,
-      })
-    }
+    for (let index = 0; index < total; index++) {}
   }
 
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'support', 'head', 'host' ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] EqualityOperator
lib/marketing/slots.ts:131:25
   for (const requirement of rankRequirements(input.requirements)) {
     const filled = spotsByRequirement.get(requirement.id) ?? []
     const total = Math.max(requirement.quantity, filled.length)
-    for (let index = 0; index < total; index++) {
+    for (let index = 0; index <= total; index++) {
       planned.push({
         roleLabel: slotLabel(requirement.role_name, index, total),
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'head', null, 'host', null, …(2) ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] LogicalOperator
lib/marketing/slots.ts:134:19
     for (let index = 0; index < total; index++) {
       planned.push({
         roleLabel: slotLabel(requirement.role_name, index, total),
-        artistId: filled[index]?.artist_id ?? null,
+        artistId: filled[index]?.artist_id && null,
       })
     }
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ null, null, null, 'support', …(2) ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] OptionalChaining
lib/marketing/slots.ts:134:19
     for (let index = 0; index < total; index++) {
       planned.push({
         roleLabel: slotLabel(requirement.role_name, index, total),
-        artistId: filled[index]?.artist_id ?? null,
+        artistId: filled[index].artist_id ?? null,
       })
     }
killedBy: marketing slot matching ignores cancelled spots
statusReason: Cannot read properties of undefined (reading 'artist_id')

[Killed] ArrowFunction
lib/marketing/slots.ts:141:48
 
   // Artister som er bekreftet på et krav som er slettet siden, skal ikke
   // forsvinne fra plakaten bare fordi kravet gjorde det.
-  const plannedArtistIds = new Set(planned.map((slot) => slot.artistId).filter(Boolean))
+  const plannedArtistIds = new Set(planned.map(() => undefined).filter(Boolean))
   for (const spot of activeSpots) {
     if (plannedArtistIds.has(spot.artist_id)) continue
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'head', 'host', 'support', …(3) ] to deeply equal [ 'head', 'host', 'support' ]

[Survived] MethodExpression
lib/marketing/slots.ts:141:36
 
   // Artister som er bekreftet på et krav som er slettet siden, skal ikke
   // forsvinne fra plakaten bare fordi kravet gjorde det.
-  const plannedArtistIds = new Set(planned.map((slot) => slot.artistId).filter(Boolean))
+  const plannedArtistIds = new Set(planned.map(slot => slot.artistId))
   for (const spot of activeSpots) {
     if (plannedArtistIds.has(spot.artist_id)) continue

[Killed] BlockStatement
lib/marketing/slots.ts:142:35
   // Artister som er bekreftet på et krav som er slettet siden, skal ikke
   // forsvinne fra plakaten bare fordi kravet gjorde det.
   const plannedArtistIds = new Set(planned.map((slot) => slot.artistId).filter(Boolean))
-  for (const spot of activeSpots) {
-    if (plannedArtistIds.has(spot.artist_id)) continue
-    plannedArtistIds.add(spot.artist_id)
-    planned.push({ roleLabel: 'Stand-up', artistId: spot.artist_id })
-  }
+  for (const spot of activeSpots) {}
 
   const slotCount = Math.max(planned.length, input.templateSlotCount ?? 0, storedByIndex.size)
killedBy: marketing slot matching retains an artist whose requirement was deleted
statusReason: expected undefined to match object { artistId: 'head', …(1) }

[Killed] ConditionalExpression
lib/marketing/slots.ts:143:9
   // forsvinne fra plakaten bare fordi kravet gjorde det.
   const plannedArtistIds = new Set(planned.map((slot) => slot.artistId).filter(Boolean))
   for (const spot of activeSpots) {
-    if (plannedArtistIds.has(spot.artist_id)) continue
+    if (false) continue
     plannedArtistIds.add(spot.artist_id)
     planned.push({ roleLabel: 'Stand-up', artistId: spot.artist_id })
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ 'head', 'host', 'support', …(3) ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] ConditionalExpression
lib/marketing/slots.ts:143:9
   // forsvinne fra plakaten bare fordi kravet gjorde det.
   const plannedArtistIds = new Set(planned.map((slot) => slot.artistId).filter(Boolean))
   for (const spot of activeSpots) {
-    if (plannedArtistIds.has(spot.artist_id)) continue
+    if (true) continue
     plannedArtistIds.add(spot.artist_id)
     planned.push({ roleLabel: 'Stand-up', artistId: spot.artist_id })
killedBy: marketing slot matching retains an artist whose requirement was deleted
statusReason: expected undefined to match object { artistId: 'head', …(1) }

[Survived] CallExpression
lib/marketing/slots.ts:144:5
   const plannedArtistIds = new Set(planned.map((slot) => slot.artistId).filter(Boolean))
   for (const spot of activeSpots) {
     if (plannedArtistIds.has(spot.artist_id)) continue
-    plannedArtistIds.add(spot.artist_id)
+    ;
     planned.push({ roleLabel: 'Stand-up', artistId: spot.artist_id })
   }

[Killed] StringLiteral
lib/marketing/slots.ts:145:31
   for (const spot of activeSpots) {
     if (plannedArtistIds.has(spot.artist_id)) continue
     plannedArtistIds.add(spot.artist_id)
-    planned.push({ roleLabel: 'Stand-up', artistId: spot.artist_id })
+    planned.push({ roleLabel: "", artistId: spot.artist_id })
   }
 
killedBy: marketing slot matching retains an artist whose requirement was deleted
statusReason: expected { slotIndex: 1, roleLabel: '', …(6) } to match object { artistId: 'head', …(1) }
(6 matching properties omitted from actual)

[Killed] MethodExpression
lib/marketing/slots.ts:148:21
     planned.push({ roleLabel: 'Stand-up', artistId: spot.artist_id })
   }
 
-  const slotCount = Math.max(planned.length, input.templateSlotCount ?? 0, storedByIndex.size)
+  const slotCount = Math.min(planned.length, input.templateSlotCount ?? 0, storedByIndex.size)
 
   return Array.from({ length: slotCount }, (_, index) => {
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [] to deeply equal [ 'head', 'host', 'support' ]
