[Killed] LogicalOperator
lib/marketing/slots.ts:148:46
     planned.push({ roleLabel: 'Stand-up', artistId: spot.artist_id })
   }
 
-  const slotCount = Math.max(planned.length, input.templateSlotCount ?? 0, storedByIndex.size)
+  const slotCount = Math.max(planned.length, input.templateSlotCount && 0, storedByIndex.size)
 
   return Array.from({ length: slotCount }, (_, index) => {
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [] to deeply equal [ 'head', 'host', 'support' ]

[Killed] BlockStatement
lib/marketing/slots.ts:150:58
 
   const slotCount = Math.max(planned.length, input.templateSlotCount ?? 0, storedByIndex.size)
 
-  return Array.from({ length: slotCount }, (_, index) => {
-    const slotIndex = index + 1
-    const auto = planned[index] ?? { roleLabel: `Slot ${slotIndex}`, artistId: null }
-    const stored = storedByIndex.get(slotIndex)
-
-    // `artist_id: null` på en lagret rad er et bevisst «la ruten stå tom»,
-    // og skal ikke falle tilbake på den automatiske matchen.
-    const isManual = stored !== undefined
-    const artistId = isManual ? stored.artist_id : auto.artistId
-    const artist = artistId ? artistById.get(artistId) : undefined
-    const customImage = stored?.image_url ?? null
-
-    return {
-      slotIndex,
-      roleLabel: auto.roleLabel,
-      artistId: artistId ?? null,
-      artistName: artist ? artistDisplayName(artist) : null,
-      imageUrl: customImage ?? artist?.profile_image_url ?? null,
-      profileImageUrl: artist?.profile_image_url ?? null,
-      hasCustomImage: Boolean(customImage),
-      isManual,
-    }
-  })
+  return Array.from({ length: slotCount }, (_, index) => {})
 }
 
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: Cannot read properties of undefined (reading 'artistId')

[Killed] ObjectLiteral
lib/marketing/slots.ts:150:21
 
   const slotCount = Math.max(planned.length, input.templateSlotCount ?? 0, storedByIndex.size)
 
-  return Array.from({ length: slotCount }, (_, index) => {
+  return Array.from({}, (_, index) => {
     const slotIndex = index + 1
     const auto = planned[index] ?? { roleLabel: `Slot ${slotIndex}`, artistId: null }
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [] to deeply equal [ 'head', 'host', 'support' ]

[Killed] ArithmeticOperator
lib/marketing/slots.ts:151:23
   const slotCount = Math.max(planned.length, input.templateSlotCount ?? 0, storedByIndex.size)
 
   return Array.from({ length: slotCount }, (_, index) => {
-    const slotIndex = index + 1
+    const slotIndex = index - 1
     const auto = planned[index] ?? { roleLabel: `Slot ${slotIndex}`, artistId: null }
     const stored = storedByIndex.get(slotIndex)
killedBy: marketing slot matching extends the plan to the selected template slot count
statusReason: expected [ 'Slot -1', 'Slot 0', 'Slot 1', …(1) ] to deeply equal [ 'Slot 1', 'Slot 2', 'Slot 3', …(1) ]

[Killed] LogicalOperator
lib/marketing/slots.ts:152:18
 
   return Array.from({ length: slotCount }, (_, index) => {
     const slotIndex = index + 1
-    const auto = planned[index] ?? { roleLabel: `Slot ${slotIndex}`, artistId: null }
+    const auto = planned[index] && {
+  roleLabel: `Slot ${slotIndex}`,
+  artistId: null
+}
     const stored = storedByIndex.get(slotIndex)
 
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ null, null, null ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] EqualityOperator
lib/marketing/slots.ts:157:22
 
     // `artist_id: null` på en lagret rad er et bevisst «la ruten stå tom»,
     // og skal ikke falle tilbake på den automatiske matchen.
-    const isManual = stored !== undefined
+    const isManual = stored === undefined
     const artistId = isManual ? stored.artist_id : auto.artistId
     const artist = artistId ? artistById.get(artistId) : undefined
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: Cannot read properties of undefined (reading 'artist_id')

[Killed] ConditionalExpression
lib/marketing/slots.ts:157:22
 
     // `artist_id: null` på en lagret rad er et bevisst «la ruten stå tom»,
     // og skal ikke falle tilbake på den automatiske matchen.
-    const isManual = stored !== undefined
+    const isManual = true
     const artistId = isManual ? stored.artist_id : auto.artistId
     const artist = artistId ? artistById.get(artistId) : undefined
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: Cannot read properties of undefined (reading 'artist_id')

[Killed] LogicalOperator
lib/marketing/slots.ts:160:25
     const isManual = stored !== undefined
     const artistId = isManual ? stored.artist_id : auto.artistId
     const artist = artistId ? artistById.get(artistId) : undefined
-    const customImage = stored?.image_url ?? null
+    const customImage = stored?.image_url && null
 
     return {
killedBy: marketing slot matching uses a custom slot image ahead of the profile image
statusReason: expected { slotIndex: 1, …(7) } to match object { imageUrl: '/press.jpg', …(2) }
(5 matching properties omitted from actual)

[Killed] OptionalChaining
lib/marketing/slots.ts:160:25
     const isManual = stored !== undefined
     const artistId = isManual ? stored.artist_id : auto.artistId
     const artist = artistId ? artistById.get(artistId) : undefined
-    const customImage = stored?.image_url ?? null
+    const customImage = stored.image_url ?? null
 
     return {
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: Cannot read properties of undefined (reading 'image_url')

[Killed] LogicalOperator
lib/marketing/slots.ts:165:17
     return {
       slotIndex,
       roleLabel: auto.roleLabel,
-      artistId: artistId ?? null,
+      artistId: artistId && null,
       artistName: artist ? artistDisplayName(artist) : null,
       imageUrl: customImage ?? artist?.profile_image_url ?? null,
killedBy: marketing slot matching ranks headliner, host, then stand-up independently of requirement order
statusReason: expected [ null, null, null ] to deeply equal [ 'head', 'host', 'support' ]

[Killed] LogicalOperator
lib/marketing/slots.ts:167:17
       roleLabel: auto.roleLabel,
       artistId: artistId ?? null,
       artistName: artist ? artistDisplayName(artist) : null,
-      imageUrl: customImage ?? artist?.profile_image_url ?? null,
+      imageUrl: customImage && artist?.profile_image_url ?? null,
       profileImageUrl: artist?.profile_image_url ?? null,
       hasCustomImage: Boolean(customImage),
killedBy: marketing slot matching uses a custom slot image ahead of the profile image
statusReason: expected { slotIndex: 1, …(7) } to match object { imageUrl: '/press.jpg', …(2) }
(5 matching properties omitted from actual)

[Killed] OptionalChaining
lib/marketing/slots.ts:167:32
       roleLabel: auto.roleLabel,
       artistId: artistId ?? null,
       artistName: artist ? artistDisplayName(artist) : null,
-      imageUrl: customImage ?? artist?.profile_image_url ?? null,
+      imageUrl: customImage ?? artist.profile_image_url ?? null,
       profileImageUrl: artist?.profile_image_url ?? null,
       hasCustomImage: Boolean(customImage),
killedBy: marketing slot matching ignores cancelled spots
statusReason: Cannot read properties of undefined (reading 'profile_image_url')

[Killed] OptionalChaining
lib/marketing/slots.ts:168:24
       artistId: artistId ?? null,
       artistName: artist ? artistDisplayName(artist) : null,
       imageUrl: customImage ?? artist?.profile_image_url ?? null,
-      profileImageUrl: artist?.profile_image_url ?? null,
+      profileImageUrl: artist.profile_image_url ?? null,
       hasCustomImage: Boolean(customImage),
       isManual,
killedBy: marketing slot matching ignores cancelled spots
statusReason: Cannot read properties of undefined (reading 'profile_image_url')

[Killed] LogicalOperator
lib/marketing/slots.ts:168:24
       artistId: artistId ?? null,
       artistName: artist ? artistDisplayName(artist) : null,
       imageUrl: customImage ?? artist?.profile_image_url ?? null,
-      profileImageUrl: artist?.profile_image_url ?? null,
+      profileImageUrl: artist?.profile_image_url && null,
       hasCustomImage: Boolean(customImage),
       isManual,
killedBy: marketing slot matching uses a custom slot image ahead of the profile image
statusReason: expected { slotIndex: 1, …(7) } to match object { imageUrl: '/press.jpg', …(2) }
(5 matching properties omitted from actual)

[Killed] BlockStatement
lib/marketing/slots.ts:185:3
   score: number
   label: string
   tone: 'exact' | 'close' | 'unknown' | 'off'
-} {
-  if (!slotCount) return { score: 2, label: 'Slot count unknown', tone: 'unknown' }
-  if (slotCount === lineupSize) return { score: 0, label: `${slotCount} slots — exact fit`, tone: 'exact' }
-
-  const diff = Math.abs(slotCount - lineupSize)
-  if (diff <= 1) {
-    return {
-      score: 1,
-      label: slotCount > lineupSize ? `${slotCount} slots — one stays empty` : `${slotCount} slots — one artist won't fit`,
-      tone: 'close',
-    }
-  }
-
-  return { score: 3 + diff, label: `${slotCount} slots`, tone: 'off' }
-}
+} {}
 
 /** Rutene AI-en faktisk kan tegne — de som har både artist og bilde. */
killedBy: marketing template fit scores 0 slots for 5 artists
statusReason: expected undefined to match object { score: 2, tone: 'unknown' }

[Killed] BooleanLiteral
lib/marketing/slots.ts:186:7
   label: string
   tone: 'exact' | 'close' | 'unknown' | 'off'
 } {
-  if (!slotCount) return { score: 2, label: 'Slot count unknown', tone: 'unknown' }
+  if (slotCount) return { score: 2, label: 'Slot count unknown', tone: 'unknown' }
   if (slotCount === lineupSize) return { score: 0, label: `${slotCount} slots — exact fit`, tone: 'exact' }
 
killedBy: marketing template fit scores 0 slots for 5 artists
statusReason: expected { score: 8, label: '0 slots', …(1) } to match object { score: 2, tone: 'unknown' }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/marketing/slots.ts:186:7
   label: string
   tone: 'exact' | 'close' | 'unknown' | 'off'
 } {
-  if (!slotCount) return { score: 2, label: 'Slot count unknown', tone: 'unknown' }
+  if (false) return { score: 2, label: 'Slot count unknown', tone: 'unknown' }
   if (slotCount === lineupSize) return { score: 0, label: `${slotCount} slots — exact fit`, tone: 'exact' }
 
killedBy: marketing template fit scores 0 slots for 5 artists
statusReason: expected { score: 8, label: '0 slots', …(1) } to match object { score: 2, tone: 'unknown' }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/marketing/slots.ts:187:7
   tone: 'exact' | 'close' | 'unknown' | 'off'
 } {
   if (!slotCount) return { score: 2, label: 'Slot count unknown', tone: 'unknown' }
-  if (slotCount === lineupSize) return { score: 0, label: `${slotCount} slots — exact fit`, tone: 'exact' }
+  if (false) return { score: 0, label: `${slotCount} slots — exact fit`, tone: 'exact' }
 
   const diff = Math.abs(slotCount - lineupSize)
killedBy: marketing template fit scores 5 slots for 5 artists
statusReason: expected { score: 1, …(2) } to match object { score: +0, tone: 'exact' }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/marketing/slots.ts:187:7
   tone: 'exact' | 'close' | 'unknown' | 'off'
 } {
   if (!slotCount) return { score: 2, label: 'Slot count unknown', tone: 'unknown' }
-  if (slotCount === lineupSize) return { score: 0, label: `${slotCount} slots — exact fit`, tone: 'exact' }
+  if (true) return { score: 0, label: `${slotCount} slots — exact fit`, tone: 'exact' }
 
   const diff = Math.abs(slotCount - lineupSize)
killedBy: marketing template fit scores 6 slots for 5 artists
statusReason: expected { score: +0, …(2) } to match object { score: 1, tone: 'close' }
(1 matching property omitted from actual)

[Killed] ArithmeticOperator
lib/marketing/slots.ts:189:25
   if (!slotCount) return { score: 2, label: 'Slot count unknown', tone: 'unknown' }
   if (slotCount === lineupSize) return { score: 0, label: `${slotCount} slots — exact fit`, tone: 'exact' }
 
-  const diff = Math.abs(slotCount - lineupSize)
+  const diff = Math.abs(slotCount + lineupSize)
   if (diff <= 1) {
     return {
killedBy: marketing template fit scores 6 slots for 5 artists
statusReason: expected { score: 14, label: '6 slots', …(1) } to match object { score: 1, tone: 'close' }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/marketing/slots.ts:190:7
   if (slotCount === lineupSize) return { score: 0, label: `${slotCount} slots — exact fit`, tone: 'exact' }
 
   const diff = Math.abs(slotCount - lineupSize)
-  if (diff <= 1) {
+  if (true) {
     return {
       score: 1,
killedBy: marketing template fit scores 8 slots for 5 artists
statusReason: expected { score: 1, …(2) } to match object { score: 6, tone: 'off' }
(1 matching property omitted from actual)

[Killed] EqualityOperator
lib/marketing/slots.ts:190:7
   if (slotCount === lineupSize) return { score: 0, label: `${slotCount} slots — exact fit`, tone: 'exact' }
 
   const diff = Math.abs(slotCount - lineupSize)
-  if (diff <= 1) {
+  if (diff > 1) {
     return {
       score: 1,
killedBy: marketing template fit scores 6 slots for 5 artists
statusReason: expected { score: 4, label: '6 slots', …(1) } to match object { score: 1, tone: 'close' }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
lib/marketing/slots.ts:193:14
   if (diff <= 1) {
     return {
       score: 1,
-      label: slotCount > lineupSize ? `${slotCount} slots — one stays empty` : `${slotCount} slots — one artist won't fit`,
+      label: true ? `${slotCount} slots — one stays empty` : `${slotCount} slots — one artist won't fit`,
       tone: 'close',
     }
killedBy: marketing template fit explains whether the close mismatch is empty or overflowing
statusReason: expected '4 slots — one stays empty' to contain 'one artist won\'t fit'

[Killed] ConditionalExpression
lib/marketing/slots.ts:193:14
   if (diff <= 1) {
     return {
       score: 1,
-      label: slotCount > lineupSize ? `${slotCount} slots — one stays empty` : `${slotCount} slots — one artist won't fit`,
+      label: false ? `${slotCount} slots — one stays empty` : `${slotCount} slots — one artist won't fit`,
       tone: 'close',
     }
killedBy: marketing template fit explains whether the close mismatch is empty or overflowing
statusReason: expected '6 slots — one artist won\'t fit' to contain 'one stays empty'

[Killed] ArithmeticOperator
lib/marketing/slots.ts:198:19
     }
   }
 
-  return { score: 3 + diff, label: `${slotCount} slots`, tone: 'off' }
+  return { score: 3 - diff, label: `${slotCount} slots`, tone: 'off' }
 }
 
killedBy: marketing template fit scores 8 slots for 5 artists
statusReason: expected { score: +0, label: '8 slots', …(1) } to match object { score: 6, tone: 'off' }
(1 matching property omitted from actual)

[Killed] BlockStatement
lib/marketing/slots.ts:202:70
 }
 
 /** Rutene AI-en faktisk kan tegne — de som har både artist og bilde. */
-export function usableSlots(slots: MarketingSlot[]): MarketingSlot[] {
-  return slots.filter((slot) => slot.artistId && slot.imageUrl)
-}
+export function usableSlots(slots: MarketingSlot[]): MarketingSlot[] {}
 
killedBy: marketing slot matching filters usable slots to those with both artist and image
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
lib/marketing/slots.ts:203:10
 
 /** Rutene AI-en faktisk kan tegne — de som har både artist og bilde. */
 export function usableSlots(slots: MarketingSlot[]): MarketingSlot[] {
-  return slots.filter((slot) => slot.artistId && slot.imageUrl)
+  return slots
 }
 
killedBy: marketing slot matching filters usable slots to those with both artist and image
statusReason: expected [ 'head', 'host', 'support' ] to deeply equal [ 'head', 'host' ]

[Killed] ArrowFunction
lib/marketing/slots.ts:203:23
 
 /** Rutene AI-en faktisk kan tegne — de som har både artist og bilde. */
 export function usableSlots(slots: MarketingSlot[]): MarketingSlot[] {
-  return slots.filter((slot) => slot.artistId && slot.imageUrl)
+  return slots.filter(() => undefined)
 }
 
killedBy: marketing slot matching filters usable slots to those with both artist and image
statusReason: expected [] to deeply equal [ 'head', 'host' ]
