[Killed] BlockStatement
lib/tickets.ts:12:56
  * koden manuelt, og da kommer den gjerne med bindestreken den vises med, eller
  * med mellomrom. Begge veier må ende på det samme.
  */
-export function extractTicketCode(raw: string): string {
-  const text = raw.trim()
-  if (!text) return ''
-
-  const query = text.match(/[?&]code=([^&\s]+)/i)
-  if (query) {
-    try {
-      return decodeURIComponent(query[1]).trim()
-    } catch {
-      return query[1].trim()
-    }
-  }
-
-  // En lenke uten `code` har koden sist i stien: /tickets/verify/<kode>.
-  if (/^https?:\/\//i.test(text)) {
-    const lastSegment = text.split(/[?#]/)[0].replace(/\/+$/, '').split('/').pop()
-    return (lastSegment ?? '').trim()
-  }
-
-  return stripSeparators(text)
-}
+export function extractTicketCode(raw: string): string {}
 
 /** Bindestrek og mellomrom er lesehjelp, ikke en del av koden. */
killedBy: ticket codes extracts and decodes a code from a verification URL
statusReason: expected undefined to be 'ABCD 1234' // Object.is equality

[Survived] MethodExpression
lib/tickets.ts:13:16
  * med mellomrom. Begge veier må ende på det samme.
  */
 export function extractTicketCode(raw: string): string {
-  const text = raw.trim()
+  const text = raw
   if (!text) return ''
 

[Killed] BooleanLiteral
lib/tickets.ts:14:7
  */
 export function extractTicketCode(raw: string): string {
   const text = raw.trim()
-  if (!text) return ''
+  if (text) return ''
 
   const query = text.match(/[?&]code=([^&\s]+)/i)
killedBy: ticket codes extracts and decodes a code from a verification URL
statusReason: expected '' to be 'ABCD 1234' // Object.is equality

[Killed] ConditionalExpression
lib/tickets.ts:14:7
  */
 export function extractTicketCode(raw: string): string {
   const text = raw.trim()
-  if (!text) return ''
+  if (true) return ''
 
   const query = text.match(/[?&]code=([^&\s]+)/i)
killedBy: ticket codes extracts and decodes a code from a verification URL
statusReason: expected '' to be 'ABCD 1234' // Object.is equality

[Killed] Regex
lib/tickets.ts:16:28
   const text = raw.trim()
   if (!text) return ''
 
-  const query = text.match(/[?&]code=([^&\s]+)/i)
+  const query = text.match(/[?&]code=([&\s]+)/i)
   if (query) {
     try {
killedBy: ticket codes extracts and decodes a code from a verification URL
statusReason: expected 'verify' to be 'ABCD 1234' // Object.is equality

[Killed] ConditionalExpression
lib/tickets.ts:17:7
   if (!text) return ''
 
   const query = text.match(/[?&]code=([^&\s]+)/i)
-  if (query) {
+  if (true) {
     try {
       return decodeURIComponent(query[1]).trim()
killedBy: ticket codes extracts the last path segment from a URL without a query code
statusReason: Cannot read properties of null (reading '1')

[Killed] ConditionalExpression
lib/tickets.ts:17:7
   if (!text) return ''
 
   const query = text.match(/[?&]code=([^&\s]+)/i)
-  if (query) {
+  if (false) {
     try {
       return decodeURIComponent(query[1]).trim()
killedBy: ticket codes extracts and decodes a code from a verification URL
statusReason: expected 'verify' to be 'ABCD 1234' // Object.is equality

[Killed] BlockStatement
lib/tickets.ts:18:9
 
   const query = text.match(/[?&]code=([^&\s]+)/i)
   if (query) {
-    try {
-      return decodeURIComponent(query[1]).trim()
-    } catch {
+    try {} catch {
       return query[1].trim()
     }
killedBy: ticket codes extracts and decodes a code from a verification URL
statusReason: expected 'verify' to be 'ABCD 1234' // Object.is equality

[Survived] MethodExpression
lib/tickets.ts:19:14
   const query = text.match(/[?&]code=([^&\s]+)/i)
   if (query) {
     try {
-      return decodeURIComponent(query[1]).trim()
+      return decodeURIComponent(query[1])
     } catch {
       return query[1].trim()

[NoCoverage] BlockStatement
lib/tickets.ts:20:13
   if (query) {
     try {
       return decodeURIComponent(query[1]).trim()
-    } catch {
-      return query[1].trim()
-    }
+    } catch {}
   }
 

[NoCoverage] MethodExpression
lib/tickets.ts:21:14
     try {
       return decodeURIComponent(query[1]).trim()
     } catch {
-      return query[1].trim()
+      return query[1]
     }
   }

[Killed] ConditionalExpression
lib/tickets.ts:26:7
   }
 
   // En lenke uten `code` har koden sist i stien: /tickets/verify/<kode>.
-  if (/^https?:\/\//i.test(text)) {
+  if (false) {
     const lastSegment = text.split(/[?#]/)[0].replace(/\/+$/, '').split('/').pop()
     return (lastSegment ?? '').trim()
killedBy: ticket codes extracts the last path segment from a URL without a query code
statusReason: expected 'https://tickethalo.com/tickets/verify…' to be 'ABCD1234' // Object.is equality

[Killed] BlockStatement
lib/tickets.ts:26:35
   }
 
   // En lenke uten `code` har koden sist i stien: /tickets/verify/<kode>.
-  if (/^https?:\/\//i.test(text)) {
-    const lastSegment = text.split(/[?#]/)[0].replace(/\/+$/, '').split('/').pop()
-    return (lastSegment ?? '').trim()
-  }
+  if (/^https?:\/\//i.test(text)) {}
 
   return stripSeparators(text)
killedBy: ticket codes extracts the last path segment from a URL without a query code
statusReason: expected 'https://tickethalo.com/tickets/verify…' to be 'ABCD1234' // Object.is equality

[Killed] StringLiteral
lib/tickets.ts:27:73
 
   // En lenke uten `code` har koden sist i stien: /tickets/verify/<kode>.
   if (/^https?:\/\//i.test(text)) {
-    const lastSegment = text.split(/[?#]/)[0].replace(/\/+$/, '').split('/').pop()
+    const lastSegment = text.split(/[?#]/)[0].replace(/\/+$/, '').split("").pop()
     return (lastSegment ?? '').trim()
   }
killedBy: ticket codes extracts the last path segment from a URL without a query code
statusReason: expected '4' to be 'ABCD1234' // Object.is equality

[Survived] Regex
lib/tickets.ts:27:55
 
   // En lenke uten `code` har koden sist i stien: /tickets/verify/<kode>.
   if (/^https?:\/\//i.test(text)) {
-    const lastSegment = text.split(/[?#]/)[0].replace(/\/+$/, '').split('/').pop()
+    const lastSegment = text.split(/[?#]/)[0].replace(/\/$/, '').split('/').pop()
     return (lastSegment ?? '').trim()
   }

[Killed] LogicalOperator
lib/tickets.ts:28:13
   // En lenke uten `code` har koden sist i stien: /tickets/verify/<kode>.
   if (/^https?:\/\//i.test(text)) {
     const lastSegment = text.split(/[?#]/)[0].replace(/\/+$/, '').split('/').pop()
-    return (lastSegment ?? '').trim()
+    return (lastSegment && '').trim()
   }
 
killedBy: ticket codes extracts the last path segment from a URL without a query code
statusReason: expected '' to be 'ABCD1234' // Object.is equality

[Survived] MethodExpression
lib/tickets.ts:28:12
   // En lenke uten `code` har koden sist i stien: /tickets/verify/<kode>.
   if (/^https?:\/\//i.test(text)) {
     const lastSegment = text.split(/[?#]/)[0].replace(/\/+$/, '').split('/').pop()
-    return (lastSegment ?? '').trim()
+    return lastSegment ?? ''
   }
 

[Killed] BlockStatement
lib/tickets.ts:35:41
 }
 
 /** Bindestrek og mellomrom er lesehjelp, ikke en del av koden. */
-function stripSeparators(value: string) {
-  return value.replace(/[\s-]+/g, '')
-}
+function stripSeparators(value: string) {}
 
 /**
killedBy: ticket codes removes manual-entry separators
statusReason: expected undefined to be 'ABCD1234' // Object.is equality

[Killed] Regex
lib/tickets.ts:36:24
 
 /** Bindestrek og mellomrom er lesehjelp, ikke en del av koden. */
 function stripSeparators(value: string) {
-  return value.replace(/[\s-]+/g, '')
+  return value.replace(/[\S-]+/g, '')
 }
 
killedBy: ticket codes removes manual-entry separators
statusReason: expected ' ' to be 'ABCD1234' // Object.is equality

[Killed] StringLiteral
lib/tickets.ts:36:35
 
 /** Bindestrek og mellomrom er lesehjelp, ikke en del av koden. */
 function stripSeparators(value: string) {
-  return value.replace(/[\s-]+/g, '')
+  return value.replace(/[\s-]+/g, "Stryker was here!")
 }
 
killedBy: ticket codes removes manual-entry separators
statusReason: expected 'ABCDStryker was here!12Stryker was he…' to be 'ABCD1234' // Object.is equality

[Killed] BlockStatement
lib/tickets.ts:46:67
  * miste tellingen. Gamle 32-tegns koder grupperes ikke — de er ikke ment for
  * å skrives inn, og et gitter av åtte grupper hjelper ingen.
  */
-export function formatTicketCode(code: string | null | undefined) {
-  const value = (code ?? '').trim()
-  if (value.length !== 8) return value
-
-  return `${value.slice(0, 4)}-${value.slice(4)}`
-}
+export function formatTicketCode(code: string | null | undefined) {}
 
 /**
killedBy: ticket codes formats an eight-character code for humans
statusReason: expected undefined to be 'ABCD-1234' // Object.is equality

[Killed] LogicalOperator
lib/tickets.ts:47:18
  * å skrives inn, og et gitter av åtte grupper hjelper ingen.
  */
 export function formatTicketCode(code: string | null | undefined) {
-  const value = (code ?? '').trim()
+  const value = (code && '').trim()
   if (value.length !== 8) return value
 
killedBy: ticket codes formats an eight-character code for humans
statusReason: expected '' to be 'ABCD-1234' // Object.is equality

[Survived] MethodExpression
lib/tickets.ts:47:17
  * å skrives inn, og et gitter av åtte grupper hjelper ingen.
  */
 export function formatTicketCode(code: string | null | undefined) {
-  const value = (code ?? '').trim()
+  const value = code ?? ''
   if (value.length !== 8) return value
 

[Killed] EqualityOperator
lib/tickets.ts:48:7
  */
 export function formatTicketCode(code: string | null | undefined) {
   const value = (code ?? '').trim()
-  if (value.length !== 8) return value
+  if (value.length === 8) return value
 
   return `${value.slice(0, 4)}-${value.slice(4)}`
killedBy: ticket codes formats an eight-character code for humans
statusReason: expected 'ABCD1234' to be 'ABCD-1234' // Object.is equality

[Killed] ConditionalExpression
lib/tickets.ts:48:7
  */
 export function formatTicketCode(code: string | null | undefined) {
   const value = (code ?? '').trim()
-  if (value.length !== 8) return value
+  if (false) return value
 
   return `${value.slice(0, 4)}-${value.slice(4)}`
killedBy: ticket codes leaves legacy code lengths unchanged
statusReason: expected 'abcd-ef' to be 'abcdef' // Object.is equality

[Killed] MethodExpression
lib/tickets.ts:50:34
   const value = (code ?? '').trim()
   if (value.length !== 8) return value
 
-  return `${value.slice(0, 4)}-${value.slice(4)}`
+  return `${value.slice(0, 4)}-${value}`
 }
 
killedBy: ticket codes formats an eight-character code for humans
statusReason: expected 'ABCD-ABCD1234' to be 'ABCD-1234' // Object.is equality

[Killed] MethodExpression
lib/tickets.ts:50:13
   const value = (code ?? '').trim()
   if (value.length !== 8) return value
 
-  return `${value.slice(0, 4)}-${value.slice(4)}`
+  return `${value}-${value.slice(4)}`
 }
 
killedBy: ticket codes formats an eight-character code for humans
statusReason: expected 'ABCD1234-1234' to be 'ABCD-1234' // Object.is equality

[Killed] BlockStatement
lib/tickets.ts:61:61
  * jokertegn, slik at en delvis kjent kode kunne truffet en annens billett.
  * Eksakt match mot noen få varianter er både trygt og presist.
  */
-export function ticketCodeCandidates(raw: string): string[] {
-  const code = extractTicketCode(raw)
-  if (!code) return []
-
-  // Nye koder er store bokstaver, gamle er små heksadesimaler, og en som
-  // taster inn gjetter uansett.
-  return [...new Set([code, code.toLowerCase(), code.toUpperCase()])]
-}
+export function ticketCodeCandidates(raw: string): string[] {}
 
killedBy: ticket codes returns unique exact-match case variants
statusReason: expected undefined to deeply equal [ 'Ab12Cd34', 'ab12cd34', 'AB12CD34' ]

[Killed] ConditionalExpression
lib/tickets.ts:63:7
  */
 export function ticketCodeCandidates(raw: string): string[] {
   const code = extractTicketCode(raw)
-  if (!code) return []
+  if (true) return []
 
   // Nye koder er store bokstaver, gamle er små heksadesimaler, og en som
killedBy: ticket codes returns unique exact-match case variants
statusReason: expected [] to deeply equal [ 'Ab12Cd34', 'ab12cd34', 'AB12CD34' ]

[Killed] BooleanLiteral
lib/tickets.ts:63:7
  */
 export function ticketCodeCandidates(raw: string): string[] {
   const code = extractTicketCode(raw)
-  if (!code) return []
+  if (code) return []
 
   // Nye koder er store bokstaver, gamle er små heksadesimaler, og en som
killedBy: ticket codes returns unique exact-match case variants
statusReason: expected [] to deeply equal [ 'Ab12Cd34', 'ab12cd34', 'AB12CD34' ]

[Killed] MethodExpression
lib/tickets.ts:67:29
 
   // Nye koder er store bokstaver, gamle er små heksadesimaler, og en som
   // taster inn gjetter uansett.
-  return [...new Set([code, code.toLowerCase(), code.toUpperCase()])]
+  return [...new Set([code, code.toUpperCase(), code.toUpperCase()])]
 }
 
killedBy: ticket codes returns unique exact-match case variants
statusReason: expected [ 'Ab12Cd34', 'AB12CD34' ] to deeply equal [ 'Ab12Cd34', 'ab12cd34', 'AB12CD34' ]

[Killed] MethodExpression
lib/tickets.ts:67:49
 
   // Nye koder er store bokstaver, gamle er små heksadesimaler, og en som
   // taster inn gjetter uansett.
-  return [...new Set([code, code.toLowerCase(), code.toUpperCase()])]
+  return [...new Set([code, code.toLowerCase(), code.toLowerCase()])]
 }
 
killedBy: ticket codes returns unique exact-match case variants
statusReason: expected [ 'Ab12Cd34', 'ab12cd34' ] to deeply equal [ 'Ab12Cd34', 'ab12cd34', 'AB12CD34' ]
