[Killed] BlockStatement
lib/artist-readiness.ts:45:91
 }
 
 /** Alt som hindrer at komikeren kan bookes. Tom liste = klar. */
-export function artistReadinessBlockers(artist: ArtistReadinessInput): ReadinessBlocker[] {
-  const blockers = new Set<ReadinessBlocker>()
-
-  if (artist.status !== 'approved') blockers.add('approval')
-  if (normalizeArtistRoleList(artist.category).length === 0) blockers.add('role')
-
-  return BLOCKER_ORDER.filter((blocker) => blockers.has(blocker))
-}
+export function artistReadinessBlockers(artist: ArtistReadinessInput): ReadinessBlocker[] {}
 
 export function isArtistBookable(artist: ArtistReadinessInput) {
killedBy: artist readiness accepts an approved artist with a recognized role
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
lib/artist-readiness.ts:48:7
 export function artistReadinessBlockers(artist: ArtistReadinessInput): ReadinessBlocker[] {
   const blockers = new Set<ReadinessBlocker>()
 
-  if (artist.status !== 'approved') blockers.add('approval')
+  if (false) blockers.add('approval')
   if (normalizeArtistRoleList(artist.category).length === 0) blockers.add('role')
 
killedBy: artist readiness requires platform approval
statusReason: expected [] to deeply equal [ 'approval' ]

[Killed] ConditionalExpression
lib/artist-readiness.ts:48:7
 export function artistReadinessBlockers(artist: ArtistReadinessInput): ReadinessBlocker[] {
   const blockers = new Set<ReadinessBlocker>()
 
-  if (artist.status !== 'approved') blockers.add('approval')
+  if (true) blockers.add('approval')
   if (normalizeArtistRoleList(artist.category).length === 0) blockers.add('role')
 
killedBy: artist readiness accepts an approved artist with a recognized role
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/artist-readiness.ts:49:7
   const blockers = new Set<ReadinessBlocker>()
 
   if (artist.status !== 'approved') blockers.add('approval')
-  if (normalizeArtistRoleList(artist.category).length === 0) blockers.add('role')
+  if (true) blockers.add('role')
 
   return BLOCKER_ORDER.filter((blocker) => blockers.has(blocker))
killedBy: artist readiness accepts an approved artist with a recognized role
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
lib/artist-readiness.ts:49:7
   const blockers = new Set<ReadinessBlocker>()
 
   if (artist.status !== 'approved') blockers.add('approval')
-  if (normalizeArtistRoleList(artist.category).length === 0) blockers.add('role')
+  if (false) blockers.add('role')
 
   return BLOCKER_ORDER.filter((blocker) => blockers.has(blocker))
killedBy: artist readiness requires a club role
statusReason: expected [] to deeply equal [ 'role' ]

[Killed] MethodExpression
lib/artist-readiness.ts:51:10
   if (artist.status !== 'approved') blockers.add('approval')
   if (normalizeArtistRoleList(artist.category).length === 0) blockers.add('role')
 
-  return BLOCKER_ORDER.filter((blocker) => blockers.has(blocker))
+  return BLOCKER_ORDER
 }
 
killedBy: artist readiness accepts an approved artist with a recognized role
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
lib/artist-readiness.ts:51:31
   if (artist.status !== 'approved') blockers.add('approval')
   if (normalizeArtistRoleList(artist.category).length === 0) blockers.add('role')
 
-  return BLOCKER_ORDER.filter((blocker) => blockers.has(blocker))
+  return BLOCKER_ORDER.filter(() => undefined)
 }
 
killedBy: artist readiness requires platform approval
statusReason: expected [] to deeply equal [ 'approval' ]

[Killed] BlockStatement
lib/artist-readiness.ts:54:64
   return BLOCKER_ORDER.filter((blocker) => blockers.has(blocker))
 }
 
-export function isArtistBookable(artist: ArtistReadinessInput) {
-  return artistReadinessBlockers(artist).length === 0
-}
+export function isArtistBookable(artist: ArtistReadinessInput) {}
 
killedBy: artist readiness accepts an approved artist with a recognized role
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
lib/artist-readiness.ts:55:10
 }
 
 export function isArtistBookable(artist: ArtistReadinessInput) {
-  return artistReadinessBlockers(artist).length === 0
+  return false
 }
 
killedBy: artist readiness accepts an approved artist with a recognized role
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
lib/artist-readiness.ts:55:10
 }
 
 export function isArtistBookable(artist: ArtistReadinessInput) {
-  return artistReadinessBlockers(artist).length === 0
+  return artistReadinessBlockers(artist).length !== 0
 }
 
killedBy: artist readiness accepts an approved artist with a recognized role
statusReason: expected false to be true // Object.is equality
