[Killed] BlockStatement
lib/booking-spots.ts:66:39
 
 const ACTIVE_SPOT_STATUSES = ['confirmed', 'completed', 'paid']
 
-function formatPercent(value: number) {
-  return Number.isInteger(value) ? String(value) : String(value).replace(/(\.\d*?)0+$/, '$1').replace(/\.$/, '')
-}
+function formatPercent(value: number) {}
 
 /** The fee as set on the lineup spot — same sources the lineup tab reads. */
killedBy: booking spot fees formats 3 fee arrangement
statusReason: expected 'undefined% of sales' to be '12.5% of sales' // Object.is equality

[Survived] Regex
lib/booking-spots.ts:67:74
 const ACTIVE_SPOT_STATUSES = ['confirmed', 'completed', 'paid']
 
 function formatPercent(value: number) {
-  return Number.isInteger(value) ? String(value) : String(value).replace(/(\.\d*?)0+$/, '$1').replace(/\.$/, '')
+  return Number.isInteger(value) ? String(value) : String(value).replace(/(\.\d)0+$/, '$1').replace(/\.$/, '')
 }
 

[Survived] StringLiteral
lib/booking-spots.ts:67:89
 const ACTIVE_SPOT_STATUSES = ['confirmed', 'completed', 'paid']
 
 function formatPercent(value: number) {
-  return Number.isInteger(value) ? String(value) : String(value).replace(/(\.\d*?)0+$/, '$1').replace(/\.$/, '')
+  return Number.isInteger(value) ? String(value) : String(value).replace(/(\.\d*?)0+$/, "").replace(/\.$/, '')
 }
 

[Killed] BlockStatement
lib/booking-spots.ts:71:89
 }
 
 /** The fee as set on the lineup spot — same sources the lineup tab reads. */
-export function requirementFeeLabel(requirement: RequirementFeeInput, currency: string) {
-  if (requirement.compensation_type === 'percent') {
-    const percent = requirement.compensation_percent
-    if (percent == null) return 'Not set'
-    if (percent === 0) return 'No fee'
-    return `${formatPercent(percent)}% of sales`
-  }
-
-  if (requirement.compensation_type === 'fixed') {
-    const amount = requirement.compensation_amount
-    if (amount == null) return 'Fixed fee'
-    if (amount === 0) return 'No fee'
-    return new Intl.NumberFormat('en-GB', { style: 'currency', currency, maximumFractionDigits: 0 }).format(amount / 100)
-  }
-
-  return 'Not set'
-}
+export function requirementFeeLabel(requirement: RequirementFeeInput, currency: string) {}
 
 /**
killedBy: booking spot fees formats 0 fee arrangement
statusReason: expected undefined to be 'Not set' // Object.is equality

[Killed] BlockStatement
lib/booking-spots.ts:72:52
 
 /** The fee as set on the lineup spot — same sources the lineup tab reads. */
 export function requirementFeeLabel(requirement: RequirementFeeInput, currency: string) {
-  if (requirement.compensation_type === 'percent') {
-    const percent = requirement.compensation_percent
-    if (percent == null) return 'Not set'
-    if (percent === 0) return 'No fee'
-    return `${formatPercent(percent)}% of sales`
-  }
+  if (requirement.compensation_type === 'percent') {}
 
   if (requirement.compensation_type === 'fixed') {
killedBy: booking spot fees formats 2 fee arrangement
statusReason: expected 'Not set' to be 'No fee' // Object.is equality

[Killed] ConditionalExpression
lib/booking-spots.ts:72:7
 
 /** The fee as set on the lineup spot — same sources the lineup tab reads. */
 export function requirementFeeLabel(requirement: RequirementFeeInput, currency: string) {
-  if (requirement.compensation_type === 'percent') {
+  if (false) {
     const percent = requirement.compensation_percent
     if (percent == null) return 'Not set'
killedBy: booking spot fees formats 2 fee arrangement
statusReason: expected 'Not set' to be 'No fee' // Object.is equality

[Killed] ConditionalExpression
lib/booking-spots.ts:74:9
 export function requirementFeeLabel(requirement: RequirementFeeInput, currency: string) {
   if (requirement.compensation_type === 'percent') {
     const percent = requirement.compensation_percent
-    if (percent == null) return 'Not set'
+    if (true) return 'Not set'
     if (percent === 0) return 'No fee'
     return `${formatPercent(percent)}% of sales`
killedBy: booking spot fees formats 2 fee arrangement
statusReason: expected 'Not set' to be 'No fee' // Object.is equality

[Killed] EqualityOperator
lib/booking-spots.ts:74:9
 export function requirementFeeLabel(requirement: RequirementFeeInput, currency: string) {
   if (requirement.compensation_type === 'percent') {
     const percent = requirement.compensation_percent
-    if (percent == null) return 'Not set'
+    if (percent != null) return 'Not set'
     if (percent === 0) return 'No fee'
     return `${formatPercent(percent)}% of sales`
killedBy: booking spot fees formats 1 fee arrangement
statusReason: expected 'null% of sales' to be 'Not set' // Object.is equality

[Killed] EqualityOperator
lib/booking-spots.ts:75:9
   if (requirement.compensation_type === 'percent') {
     const percent = requirement.compensation_percent
     if (percent == null) return 'Not set'
-    if (percent === 0) return 'No fee'
+    if (percent !== 0) return 'No fee'
     return `${formatPercent(percent)}% of sales`
   }
killedBy: booking spot fees formats 2 fee arrangement
statusReason: expected '0% of sales' to be 'No fee' // Object.is equality

[Killed] ConditionalExpression
lib/booking-spots.ts:75:9
   if (requirement.compensation_type === 'percent') {
     const percent = requirement.compensation_percent
     if (percent == null) return 'Not set'
-    if (percent === 0) return 'No fee'
+    if (false) return 'No fee'
     return `${formatPercent(percent)}% of sales`
   }
killedBy: booking spot fees formats 2 fee arrangement
statusReason: expected '0% of sales' to be 'No fee' // Object.is equality

[Killed] ConditionalExpression
lib/booking-spots.ts:79:7
     return `${formatPercent(percent)}% of sales`
   }
 
-  if (requirement.compensation_type === 'fixed') {
+  if (false) {
     const amount = requirement.compensation_amount
     if (amount == null) return 'Fixed fee'
killedBy: booking spot fees formats 4 fee arrangement
statusReason: expected 'Not set' to be 'Fixed fee' // Object.is equality

[Killed] BlockStatement
lib/booking-spots.ts:79:50
     return `${formatPercent(percent)}% of sales`
   }
 
-  if (requirement.compensation_type === 'fixed') {
-    const amount = requirement.compensation_amount
-    if (amount == null) return 'Fixed fee'
-    if (amount === 0) return 'No fee'
-    return new Intl.NumberFormat('en-GB', { style: 'currency', currency, maximumFractionDigits: 0 }).format(amount / 100)
-  }
+  if (requirement.compensation_type === 'fixed') {}
 
   return 'Not set'
killedBy: booking spot fees formats 4 fee arrangement
statusReason: expected 'Not set' to be 'Fixed fee' // Object.is equality

[Killed] EqualityOperator
lib/booking-spots.ts:81:9
 
   if (requirement.compensation_type === 'fixed') {
     const amount = requirement.compensation_amount
-    if (amount == null) return 'Fixed fee'
+    if (amount != null) return 'Fixed fee'
     if (amount === 0) return 'No fee'
     return new Intl.NumberFormat('en-GB', { style: 'currency', currency, maximumFractionDigits: 0 }).format(amount / 100)
killedBy: booking spot fees formats 4 fee arrangement
statusReason: expected 'NOK 0' to be 'Fixed fee' // Object.is equality

[Killed] ConditionalExpression
lib/booking-spots.ts:81:9
 
   if (requirement.compensation_type === 'fixed') {
     const amount = requirement.compensation_amount
-    if (amount == null) return 'Fixed fee'
+    if (true) return 'Fixed fee'
     if (amount === 0) return 'No fee'
     return new Intl.NumberFormat('en-GB', { style: 'currency', currency, maximumFractionDigits: 0 }).format(amount / 100)
killedBy: booking spot fees formats 5 fee arrangement
statusReason: expected 'Fixed fee' to be 'No fee' // Object.is equality

[Killed] ConditionalExpression
lib/booking-spots.ts:82:9
   if (requirement.compensation_type === 'fixed') {
     const amount = requirement.compensation_amount
     if (amount == null) return 'Fixed fee'
-    if (amount === 0) return 'No fee'
+    if (false) return 'No fee'
     return new Intl.NumberFormat('en-GB', { style: 'currency', currency, maximumFractionDigits: 0 }).format(amount / 100)
   }
killedBy: booking spot fees formats 5 fee arrangement
statusReason: expected 'NOK 0' to be 'No fee' // Object.is equality

[Killed] EqualityOperator
lib/booking-spots.ts:82:9
   if (requirement.compensation_type === 'fixed') {
     const amount = requirement.compensation_amount
     if (amount == null) return 'Fixed fee'
-    if (amount === 0) return 'No fee'
+    if (amount !== 0) return 'No fee'
     return new Intl.NumberFormat('en-GB', { style: 'currency', currency, maximumFractionDigits: 0 }).format(amount / 100)
   }
killedBy: booking spot fees formats 5 fee arrangement
statusReason: expected 'NOK 0' to be 'No fee' // Object.is equality

[Killed] ArithmeticOperator
lib/booking-spots.ts:83:109
     const amount = requirement.compensation_amount
     if (amount == null) return 'Fixed fee'
     if (amount === 0) return 'No fee'
-    return new Intl.NumberFormat('en-GB', { style: 'currency', currency, maximumFractionDigits: 0 }).format(amount / 100)
+    return new Intl.NumberFormat('en-GB', { style: 'currency', currency, maximumFractionDigits: 0 }).format(amount * 100)
   }
 
killedBy: booking spot fees formats 6 fee arrangement
statusReason: expected 'NOK 10,000,000' to be 'NOK 1,000' // Object.is equality

[Killed] MethodExpression
lib/booking-spots.ts:110:20
   let position = 0
 
   return requirements.flatMap((requirement) => {
-    const booked = confirmedSpots
-      .filter((spot) => spot.show_requirement_id === requirement.id && ACTIVE_SPOT_STATUSES.includes(spot.status))
+    const booked = confirmedSpots
     const pending = offers
       .filter((offer) => offer.show_requirement_id === requirement.id && offer.status === 'sent')
killedBy: booking spot construction ignores inactive confirmed status cancelled
statusReason: expected 'booked' to be 'open' // Object.is equality

[Killed] EqualityOperator
lib/booking-spots.ts:111:25
 
   return requirements.flatMap((requirement) => {
     const booked = confirmedSpots
-      .filter((spot) => spot.show_requirement_id === requirement.id && ACTIVE_SPOT_STATUSES.includes(spot.status))
+      .filter((spot) => spot.show_requirement_id !== requirement.id && ACTIVE_SPOT_STATUSES.includes(spot.status))
     const pending = offers
       .filter((offer) => offer.show_requirement_id === requirement.id && offer.status === 'sent')
killedBy: booking spot construction treats confirmed spots as booked
statusReason: expected { key: 'r1-0', position: 1, …(9) } to match object { state: 'booked', …(2) }
(11 matching properties omitted from actual)

[Killed] ConditionalExpression
lib/booking-spots.ts:111:25
 
   return requirements.flatMap((requirement) => {
     const booked = confirmedSpots
-      .filter((spot) => spot.show_requirement_id === requirement.id && ACTIVE_SPOT_STATUSES.includes(spot.status))
+      .filter((spot) => false)
     const pending = offers
       .filter((offer) => offer.show_requirement_id === requirement.id && offer.status === 'sent')
killedBy: booking spot construction treats confirmed spots as booked
statusReason: expected { key: 'r1-0', position: 1, …(9) } to match object { state: 'booked', …(2) }
(11 matching properties omitted from actual)

[Killed] MethodExpression
lib/booking-spots.ts:112:21
   return requirements.flatMap((requirement) => {
     const booked = confirmedSpots
       .filter((spot) => spot.show_requirement_id === requirement.id && ACTIVE_SPOT_STATUSES.includes(spot.status))
-    const pending = offers
-      .filter((offer) => offer.show_requirement_id === requirement.id && offer.status === 'sent')
+    const pending = offers
     const feeLabel = requirementFeeLabel(requirement, currency)
     const fee: BookingSpotFee = {
killedBy: booking spot construction ignores offers belonging to another requirement
statusReason: expected 'pending' to be 'open' // Object.is equality

[Killed] EqualityOperator
lib/booking-spots.ts:113:26
     const booked = confirmedSpots
       .filter((spot) => spot.show_requirement_id === requirement.id && ACTIVE_SPOT_STATUSES.includes(spot.status))
     const pending = offers
-      .filter((offer) => offer.show_requirement_id === requirement.id && offer.status === 'sent')
+      .filter((offer) => offer.show_requirement_id !== requirement.id && offer.status === 'sent')
     const feeLabel = requirementFeeLabel(requirement, currency)
     const fee: BookingSpotFee = {
killedBy: booking spot construction places booked artists before pending offers
statusReason: expected [ [ 'booked', 'Ada' ], …(2) ] to deeply equal [ [ 'booked', 'Ada' ], …(2) ]

[Killed] LogicalOperator
lib/booking-spots.ts:113:26
     const booked = confirmedSpots
       .filter((spot) => spot.show_requirement_id === requirement.id && ACTIVE_SPOT_STATUSES.includes(spot.status))
     const pending = offers
-      .filter((offer) => offer.show_requirement_id === requirement.id && offer.status === 'sent')
+      .filter((offer) => offer.show_requirement_id === requirement.id || offer.status === 'sent')
     const feeLabel = requirementFeeLabel(requirement, currency)
     const fee: BookingSpotFee = {
killedBy: booking spot construction ignores offers belonging to another requirement
statusReason: expected 'pending' to be 'open' // Object.is equality

[Killed] BlockStatement
lib/booking-spots.ts:121:84
       percent: requirement.compensation_percent,
     }
 
-    return Array.from({ length: Math.max(requirement.quantity, 1) }, (_, index) => {
-      position += 1
-      const bookedSpot = booked[index]
-      const pendingOffer = bookedSpot ? undefined : pending[index - booked.length]
-      const artistId = bookedSpot?.artist_id ?? pendingOffer?.artist_id ?? null
-
-      return {
-        key: `${requirement.id}-${index}`,
-        position,
-        requirementId: requirement.id,
-        roleName: requirement.role_name,
-        artistName: artistId ? artistName(artistId) : null,
-        artistId,
-        spotId: bookedSpot?.id ?? null,
-        offerId: pendingOffer?.id ?? null,
-        feeLabel,
-        fee,
-        state: bookedSpot ? 'booked' : pendingOffer ? 'pending' : 'open',
-      } satisfies BookingSpot
-    })
+    return Array.from({ length: Math.max(requirement.quantity, 1) }, (_, index) => {})
   })
 }
killedBy: booking spot construction creates one open row for a requirement with quantity zero
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] MethodExpression
lib/booking-spots.ts:121:33
       percent: requirement.compensation_percent,
     }
 
-    return Array.from({ length: Math.max(requirement.quantity, 1) }, (_, index) => {
+    return Array.from({ length: Math.min(requirement.quantity, 1) }, (_, index) => {
       position += 1
       const bookedSpot = booked[index]
killedBy: booking spot construction creates one open row for a requirement with quantity zero
statusReason: expected [] to have a length of 1 but got +0

[Killed] AssignmentOperator
lib/booking-spots.ts:122:7
     }
 
     return Array.from({ length: Math.max(requirement.quantity, 1) }, (_, index) => {
-      position += 1
+      position -= 1
       const bookedSpot = booked[index]
       const pendingOffer = bookedSpot ? undefined : pending[index - booked.length]
killedBy: booking spot construction expands quantity into sequential seats
statusReason: expected [ Array(3) ] to deeply equal [ [ 'r1-0', 1 ], [ 'r1-1', 2 ], …(1) ]

[Killed] ArithmeticOperator
lib/booking-spots.ts:124:61
     return Array.from({ length: Math.max(requirement.quantity, 1) }, (_, index) => {
       position += 1
       const bookedSpot = booked[index]
-      const pendingOffer = bookedSpot ? undefined : pending[index - booked.length]
+      const pendingOffer = bookedSpot ? undefined : pending[index + booked.length]
       const artistId = bookedSpot?.artist_id ?? pendingOffer?.artist_id ?? null
 
killedBy: booking spot construction places booked artists before pending offers
statusReason: expected [ [ 'booked', 'Ada' ], …(2) ] to deeply equal [ [ 'booked', 'Ada' ], …(2) ]

[Killed] OptionalChaining
lib/booking-spots.ts:125:24
       position += 1
       const bookedSpot = booked[index]
       const pendingOffer = bookedSpot ? undefined : pending[index - booked.length]
-      const artistId = bookedSpot?.artist_id ?? pendingOffer?.artist_id ?? null
+      const artistId = bookedSpot.artist_id ?? pendingOffer?.artist_id ?? null
 
       return {
killedBy: booking spot construction creates one open row for a requirement with quantity zero
statusReason: Cannot read properties of undefined (reading 'artist_id')

[Killed] OptionalChaining
lib/booking-spots.ts:125:49
       position += 1
       const bookedSpot = booked[index]
       const pendingOffer = bookedSpot ? undefined : pending[index - booked.length]
-      const artistId = bookedSpot?.artist_id ?? pendingOffer?.artist_id ?? null
+      const artistId = bookedSpot?.artist_id ?? pendingOffer.artist_id ?? null
 
       return {
killedBy: booking spot construction creates one open row for a requirement with quantity zero
statusReason: Cannot read properties of undefined (reading 'artist_id')

[Killed] ObjectLiteral
lib/booking-spots.ts:127:14
       const pendingOffer = bookedSpot ? undefined : pending[index - booked.length]
       const artistId = bookedSpot?.artist_id ?? pendingOffer?.artist_id ?? null
 
-      return {
-        key: `${requirement.id}-${index}`,
-        position,
-        requirementId: requirement.id,
-        roleName: requirement.role_name,
-        artistName: artistId ? artistName(artistId) : null,
-        artistId,
-        spotId: bookedSpot?.id ?? null,
-        offerId: pendingOffer?.id ?? null,
-        feeLabel,
-        fee,
-        state: bookedSpot ? 'booked' : pendingOffer ? 'pending' : 'open',
-      } satisfies BookingSpot
+      return {} satisfies BookingSpot
     })
   })
killedBy: booking spot construction creates one open row for a requirement with quantity zero
statusReason: expected undefined to be 'open' // Object.is equality

[Killed] OptionalChaining
lib/booking-spots.ts:134:17
         roleName: requirement.role_name,
         artistName: artistId ? artistName(artistId) : null,
         artistId,
-        spotId: bookedSpot?.id ?? null,
+        spotId: bookedSpot.id ?? null,
         offerId: pendingOffer?.id ?? null,
         feeLabel,
killedBy: booking spot construction creates one open row for a requirement with quantity zero
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
lib/booking-spots.ts:134:17
         roleName: requirement.role_name,
         artistName: artistId ? artistName(artistId) : null,
         artistId,
-        spotId: bookedSpot?.id ?? null,
+        spotId: bookedSpot?.id && null,
         offerId: pendingOffer?.id ?? null,
         feeLabel,
killedBy: booking spot construction treats confirmed spots as booked
statusReason: expected { key: 'r1-0', position: 1, …(9) } to match object { state: 'booked', …(2) }
(11 matching properties omitted from actual)

[Killed] OptionalChaining
lib/booking-spots.ts:135:18
         artistName: artistId ? artistName(artistId) : null,
         artistId,
         spotId: bookedSpot?.id ?? null,
-        offerId: pendingOffer?.id ?? null,
+        offerId: pendingOffer.id ?? null,
         feeLabel,
         fee,
killedBy: booking spot construction creates one open row for a requirement with quantity zero
statusReason: Cannot read properties of undefined (reading 'id')

[Survived] LogicalOperator
lib/booking-spots.ts:135:18
         artistName: artistId ? artistName(artistId) : null,
         artistId,
         spotId: bookedSpot?.id ?? null,
-        offerId: pendingOffer?.id ?? null,
+        offerId: pendingOffer?.id && null,
         feeLabel,
         fee,

[Killed] StringLiteral
lib/booking-spots.ts:138:29
         offerId: pendingOffer?.id ?? null,
         feeLabel,
         fee,
-        state: bookedSpot ? 'booked' : pendingOffer ? 'pending' : 'open',
+        state: bookedSpot ? "" : pendingOffer ? 'pending' : 'open',
       } satisfies BookingSpot
     })
killedBy: booking spot construction treats confirmed spots as booked
statusReason: expected { key: 'r1-0', position: 1, …(9) } to match object { state: 'booked', …(2) }
(11 matching properties omitted from actual)
