[Killed] BlockStatement
lib/marketing/export-formats.ts:90:72
   },
 ]
 
-export function exportSpec(format: string): MarketingExportSpec | null {
-  return MARKETING_EXPORT_SPECS.find((spec) => spec.format === format) ?? null
-}
+export function exportSpec(format: string): MarketingExportSpec | null {}
 
 export function isMarketingExportFormat(value: unknown): value is MarketingExportFormat {
killedBy: poster export format contracts defines facebook_event correctly
statusReason: expected undefined to match object { format: 'facebook_event', …(5) }

[Killed] ConditionalExpression
lib/marketing/export-formats.ts:91:48
 ]
 
 export function exportSpec(format: string): MarketingExportSpec | null {
-  return MARKETING_EXPORT_SPECS.find((spec) => spec.format === format) ?? null
+  return MARKETING_EXPORT_SPECS.find((spec) => true) ?? null
 }
 
killedBy: poster export format contracts defines social_post correctly
statusReason: expected { format: 'facebook_event', …(7) } to match object { format: 'social_post', …(5) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
lib/marketing/export-formats.ts:91:48
 ]
 
 export function exportSpec(format: string): MarketingExportSpec | null {
-  return MARKETING_EXPORT_SPECS.find((spec) => spec.format === format) ?? null
+  return MARKETING_EXPORT_SPECS.find((spec) => false) ?? null
 }
 
killedBy: poster export format contracts defines facebook_event correctly
statusReason: expected null to match object { format: 'facebook_event', …(5) }

[Killed] BlockStatement
lib/marketing/export-formats.ts:94:89
   return MARKETING_EXPORT_SPECS.find((spec) => spec.format === format) ?? null
 }
 
-export function isMarketingExportFormat(value: unknown): value is MarketingExportFormat {
-  return typeof value === 'string' && MARKETING_EXPORT_SPECS.some((spec) => spec.format === value)
-}
+export function isMarketingExportFormat(value: unknown): value is MarketingExportFormat {}
 
killedBy: poster export format contracts defines facebook_event correctly
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
lib/marketing/export-formats.ts:95:10
 }
 
 export function isMarketingExportFormat(value: unknown): value is MarketingExportFormat {
-  return typeof value === 'string' && MARKETING_EXPORT_SPECS.some((spec) => spec.format === value)
+  return false
 }
 
killedBy: poster export format contracts defines facebook_event correctly
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
lib/marketing/export-formats.ts:95:10
 }
 
 export function isMarketingExportFormat(value: unknown): value is MarketingExportFormat {
-  return typeof value === 'string' && MARKETING_EXPORT_SPECS.some((spec) => spec.format === value)
+  return typeof value === 'string' || MARKETING_EXPORT_SPECS.some(spec => spec.format === value)
 }
 
killedBy: poster export format contracts rejects unknown format ""
statusReason: expected true to be false // Object.is equality
